{
  "slug": "30-question-security-audit-checklist-sme-it-managers",
  "metadata": {
    "title": "30-Question Security Audit Checklist for SME IT Managers",
    "description": "A lightweight quarterly security audit approach for SMEs without expensive consultants or compliance claims.",
    "date": "2026-01-01",
    "pillar": "AUDIT",
    "tags": [
      "security-audit",
      "sme",
      "audit-checklist"
    ]
  },
  "translatedMetadata": {
    "fr": {
      "title": "Liste de contrôle d'audit de sécurité en 30 questions pour les responsables informatiques des PME",
      "description": "Une approche légère d'audit de sécurité trimestriel pour les PME sans consultants coûteux ni réclamations de conformité.",
      "date": "2026-01-01",
      "pillar": "AUDIT",
      "tags": [
        "audit de sécurité",
        "moi",
        "liste de contrôle d'audit"
      ]
    }
  },
  "content": "@@ -1,141 +1,149 @@\r\n<h2 id=\"intro\">Intro</h2>\r\nSecurity audits don’t have to be painful, expensive, or reserved for large enterprises. For SMEs, the goal is simple: quickly verify that the security basics are actually working, and that the riskiest gaps are visible and owned. This post gives you a lightweight approach you can run quarterly (and before major changes) without claiming “compliance.” Use it to gather evidence, spot high-impact fixes, and create a short, trackable action plan.\r\n\r\n<h2 id=\"quick-take\">Quick take</h2>\r\n<ul>\n<li>Define scope and “crown jewels” first, or you’ll audit everything and learn nothing.</li>\n<li>Ask for evidence (screenshots, logs, configs, tickets), not promises.</li>\n<li>Prioritize identity, patching, backups, and monitoring—most SME incidents start there.</li>\n<li>Turn findings into owners, due dates, and verification steps.</li>\n<li>Repeat on a cadence (quarterly) and after major changes (new SaaS, M&A, new firewall).</li>\n</ul>\n\r\n<h2 id=\"1-set-the-audit-scope-systems-data-and-acceptable-risk\">1) Set the audit scope: systems, data, and acceptable risk</h2>\r\nA good SME audit starts with boundaries. If you don’t define what matters most, your checklist becomes a long list of “nice-to-haves” and your team loses momentum.\r\n\r\nPractical steps:\r\n<ol>\n<li>List your critical business services (e.g., email, file storage, ERP/finance, customer database, e-commerce, remote access). These are your primary audit targets.</li>\n<li>Identify your “crown jewel” data types: customer PII, payment data, credentials/secrets, intellectual property, financial records.</li>\n<li>Map where that data lives: endpoints, servers, SaaS apps, cloud storage, on-prem shares.</li>\n<li>Define risk tolerance in plain language. Example: “We accept brief outages for internal tools, but not for billing; we can tolerate low-risk data exposure, but not customer PII.”</li>\n</ol>\n\r\nExample: If your customer database is in a SaaS CRM and your staff authenticate via a single identity provider, your audit should spend more time on identity controls (MFA, conditional access, logging) than on local server hardening.\r\n\r\nDeliverable to produce:\r\n<ul>\n<li>A one-page scope document: in-scope apps, networks, user groups, and a short “out of scope” list.</li>\n</ul>\n\r\n<h2 id=\"2-collect-evidence-efficiently-and-avoid-checkbox-theater\">2) Collect evidence efficiently (and avoid checkbox theater)</h2>\r\nAudits fail when they rely on verbal assurances: “Yes, we do backups.” Your goal is to collect lightweight evidence that a control exists and is effective.\r\n\r\nEvidence types that work well for SMEs:\r\n<ul>\n<li>Screenshots of key settings (MFA enforced, password policy, device encryption).</li>\n<li>Exported lists (admin accounts, MFA enrollment report, list of SaaS integrations).</li>\n<li>Sample logs (sign-in logs, endpoint alerts, firewall denies) covering the last 7–30 days.</li>\n<li>Tickets or change records showing patching, access approvals, and incidents.</li>\n</ul>\n\r\nHow to sample without boiling the ocean:\r\n<ul>\n<li>Pick a representative sample: 10–20 endpoints, 3–5 critical servers, 5–10 key SaaS apps.</li>\n<li>Sample by risk: executives, finance, IT admins, and remote users first.</li>\n<li>Validate “control works” by testing. Example: attempt to log in to a test account without MFA; confirm it is blocked.</li>\n</ul>\n\r\nExample “evidence request” you can send internally:\r\n<ul>\n<li>“Provide the list of accounts with global admin privileges and proof of MFA enforcement.”</li>\n<li>“Provide the last successful restore test record (date, system, result).”</li>\n<li>“Provide the patch report showing OS and browser patch status for all managed endpoints.”</li>\n</ul>\n\r\n<h2 id=\"3-audit-the-controls-that-stop-real-world-sme-incidents\">3) Audit the controls that stop real-world SME incidents</h2>\r\nMost SME compromises trace back to a small set of control failures: weak identity hygiene, exposed remote access, unpatched systems, poor backups, and limited detection.\r\n\r\nBelow are practical audit themes and what “good” looks like—without overcomplicating it.\r\n\r\n<h3 id=\"identity-and-access-especially-admins\">Identity and access (especially admins)</h3>\r\n<ul>\n<li>Ensure MFA is required for all users, and stronger requirements exist for admins.</li>\n<li>Reduce the number of admin accounts; use separate admin identities for privileged work.</li>\n<li>Review third-party access and SaaS integrations (OAuth apps, API keys, service accounts).</li>\n</ul>\n\r\nExample: If a finance mailbox can approve payments, verify that the account has MFA, that sign-ins are logged, and that mailbox forwarding rules are restricted and monitored.\r\n\r\n<h3 id=\"patching-and-configuration\">Patching and configuration</h3>\r\n<ul>\n<li>Track patch status for OS, browsers, VPN clients, and key apps.</li>\n<li>Ensure unsupported systems are identified and either upgraded or isolated.</li>\n<li>Confirm configuration baselines for endpoints/servers: firewall on, disk encryption, secure remote management.</li>\n</ul>\n\r\nExample: If you use remote access tools, audit whether they’re restricted to corporate-managed devices and whether logs are retained.\r\n\r\n<h3 id=\"backups-and-recovery\">Backups and recovery</h3>\r\n<ul>\n<li>Validate the “3-2-1” idea (multiple copies, multiple media, one offline/immutable if possible) in principle, even if implementation is simple.</li>\n<li>Ensure backups include SaaS data you rely on (email, file shares, CRM exports).</li>\n<li>Run restore tests and document outcomes.</li>\n</ul>\n\r\nExample: Don’t just confirm that backups run—restore a file and a system image to verify speed and integrity.\r\n\r\n<h3 id=\"logging-and-detection\">Logging and detection</h3>\r\n<ul>\n<li>Centralize at least critical logs: identity provider sign-ins, endpoint alerts, firewall/VPN logs.</li>\n<li>Ensure alerting is actionable and routed to a monitored channel.</li>\n<li>Define “minimum viable monitoring” for SMEs: account lockouts, impossible travel alerts (if available), new admin creation, suspicious inbox rules, ransomware/EDR high-severity alerts.</li>\n</ul>\n\r\nExample: If alerts go to an unmonitored mailbox, you effectively have no detection.\r\n\r\n<h2 id=\"4-turn-findings-into-a-realistic-remediation-plan\">4) Turn findings into a realistic remediation plan</h2>\r\nThe audit is only useful if it drives measurable improvements. Keep the output short and operational.\r\n\r\nA practical way to rank findings:\r\n<ul>\n<li>Severity: What’s the impact if exploited (data loss, financial fraud, downtime)?</li>\n<li>Likelihood: Is it exposed to the internet? Is it common attack path? Is it already happening (alerts)?</li>\n<li>Effort: Low (hours), Medium (days), High (weeks/months).</li>\n</ul>\n\r\nWrite findings in a format your team can execute:\r\n<ul>\n<li>“Issue: MFA not enforced for legacy email access.</li>\n<li>Risk: Account takeover via password spraying.</li>\n<li>Evidence: Legacy protocol enabled; users can sign in without MFA.</li>\n<li>Fix: Disable legacy auth; enforce MFA; monitor failed sign-ins.</li>\n<li>Owner: IT Manager.</li>\n<li>Due: 30 days.</li>\n<li>Verify: Test sign-in; review sign-in logs.”</li>\n</ul>\n\r\nAim for quick wins first:\r\n<ul>\n<li>Disable unused accounts and stale admin privileges.</li>\n<li>Enforce MFA everywhere.</li>\n<li>Patch internet-facing systems.</li>\n<li>Run a restore test.</li>\n</ul>\n\r\n<h2 id=\"checklist\">Checklist</h2>\r\nUse these 30 questions as your audit runbook. Answer each with evidence and capture an action if the answer is “No” or “Not sure.”\r\n\r\n<ul>\n<li>[ ] Scope: Have you defined the in-scope systems, networks, and critical data stores?</li>\n<li>[ ] Scope: Do you know your top 5 “crown jewel” datasets and who owns each?</li>\n<li>[ ] Inventory: Do you have an up-to-date inventory of endpoints, servers, and key SaaS apps?</li>\n<li>[ ] Inventory: Can you identify all internet-facing services (VPN, remote access, web apps)?</li>\n<li>[ ] Identity: Is MFA enforced for all users (not just admins) on your primary identity/email platform?</li>\n<li>[ ] Identity: Are admin privileges minimized and reviewed at least quarterly?</li>\n<li>[ ] Identity: Do admins use separate accounts for privileged tasks (no daily-driver admin)?</li>\n<li>[ ] Identity: Are shared accounts avoided, or if unavoidable, controlled with strong compensating controls?</li>\n<li>[ ] Access: Is there a documented joiner/mover/leaver process with timely deprovisioning?</li>\n<li>[ ] Access: Are third-party/vendor accounts reviewed and removed when no longer needed?</li>\n<li>[ ] Email: Are mailbox forwarding rules restricted and periodically reviewed?</li>\n<li>[ ] Endpoint: Are corporate endpoints encrypted (full disk) and protected with a host firewall?</li>\n<li>[ ] Endpoint: Do you have a standard build/baseline (secure configuration) for endpoints?</li>\n<li>[ ] Endpoint: Is there an endpoint protection/detection capability deployed on all managed devices?</li>\n<li>[ ] Patching: Do you have a patch policy with timelines (e.g., critical within days/weeks) and proof of execution?</li>\n<li>[ ] Patching: Are unsupported OS/applications identified, tracked, and actively remediated?</li>\n<li>[ ] Network: Is remote access (VPN/RDP/remote tools) restricted, monitored, and protected by MFA?</li>\n<li>[ ] Network: Are default passwords removed and device management interfaces not exposed to the internet?</li>\n<li>[ ] Data: Is sensitive data classified or at least labeled by type and location (even informally)?</li>\n<li>[ ] Data: Are file shares/cloud storage permissions reviewed for excessive access (e.g., “Everyone”)?</li>\n<li>[ ] Data: Are secrets (API keys, passwords) stored in approved locations (not spreadsheets/email)?</li>\n<li>[ ] Backups: Do backups cover critical servers and critical SaaS data (email/files/CRM as applicable)?</li>\n<li>[ ] Backups: Are backups protected from deletion/tampering (separate credentials, offline/immutable where possible)?</li>\n<li>[ ] Backups: Have you performed and documented a restore test in the last 90 days?</li>\n<li>[ ] Logging: Are sign-in logs, admin changes, and endpoint alerts retained and reviewable?</li>\n<li>[ ] Logging: Do alerts go to a monitored channel with an on-call/backup contact?</li>\n<li>[ ] Incident readiness: Do you have an incident response checklist with key contacts and steps?</li>\n<li>[ ] Incident readiness: Have you run a tabletop exercise in the last year (even 30 minutes)?</li>\n<li>[ ] Change control: Are major changes (new SaaS, new firewall rules, new admins) recorded and approved?</li>\n<li>[ ] Risk: Do you maintain a simple risk register with owners and remediation dates for top findings?</li>\n</ul>\n\r\n<h2 id=\"faq\">FAQ</h2>\r\n<strong>1) How often should an SME run a security audit like this?</strong>\r\nQuarterly is a practical cadence, plus after major changes (new systems, mergers, big network changes) or after an incident.\r\n\r\n<strong>2) What’s the difference between an audit and a vulnerability scan?</strong>\r\nA vulnerability scan finds technical weaknesses; an audit checks whether key security controls and processes exist, work, and are evidenced.",
  "translatedContent": {
    "fr": "@@ -1 141 +1 149 @@<h2 id=\"intro\">Introduction</h2>Les audits de sécurité ne doivent pas nécessairement être pénibles, coûteux ou réservés aux grandes entreprises. Pour les PME, l’objectif est simple : vérifier rapidement que les bases de sécurité fonctionnent réellement et que les failles les plus risquées sont visibles et maîtrisées. Cet article vous propose une approche légère que vous pouvez exécuter tous les trimestres (et avant les changements majeurs) sans prétendre « conformité ». Utilisez-le pour rassembler des preuves, repérer les correctifs à fort impact et créer un plan d'action court et traçable.<h2 id=\"quick-take\">Prise rapide</h2><ul><li>Définissez d’abord la portée et les « joyaux de la couronne », sinon vous auditerez tout et n’apprendrez rien.</li><li>Demandez des preuves (captures d'écran, journaux, configurations, tickets), pas des promesses.</li><li>Donnez la priorité à l’identité, aux correctifs, aux sauvegardes et à la surveillance : la plupart des incidents PME commencent par là.</li><li>Transformez les résultats en propriétaires, dates d'échéance et étapes de vérification.</li><li>Répétez à une cadence (trimestrielle) et après des changements majeurs (nouveau SaaS, M&A, nouveau pare-feu).</li></ul><h2 id=\"1-set-the-audit-scope-systems-data-and-acceptable-risk\">1) Définir la portée de l'audit : systèmes, données et risque acceptable</h2>Un bon audit de PME commence par des limites. Si vous ne définissez pas ce qui compte le plus, votre liste de contrôle se transforme en une longue liste de « bons à avoir » et votre équipe perd son élan.\r\n\r\nÉtapes pratiques :<ol><li>Répertoriez vos services commerciaux critiques (par exemple, courrier électronique, stockage de fichiers, ERP/finance, base de données clients, commerce électronique, accès à distance). Ce sont vos principales cibles d’audit.</li><li>Identifiez vos types de données « joyau de la couronne » : informations personnelles des clients, données de paiement, informations d'identification/secrets, propriété intellectuelle, dossiers financiers.</li><li>Cartographiez l'emplacement de ces données : points de terminaison, serveurs, applications SaaS, stockage cloud, partages sur site.</li><li>Définissez la tolérance au risque dans un langage simple. Exemple : \"Nous acceptons de brèves pannes pour les outils internes, mais pas pour la facturation ; nous pouvons tolérer une exposition de données à faible risque, mais pas les informations personnelles des clients.\"</li></ol>Exemple : Si votre base de données clients est dans un CRM SaaS et que votre personnel s'authentifie via un seul fournisseur d'identité, votre audit devrait consacrer plus de temps aux contrôles d'identité (MFA, accès conditionnel, journalisation) qu'au renforcement du serveur local.\r\n\r\nLivrable à produire :<ul><li>Un document de portée d'une page : applications, réseaux, groupes d'utilisateurs concernés et une courte liste « hors de portée ».</li></ul><h2 id=\"2-collect-evidence-efficiently-and-avoid-checkbox-theater\">2) Collectez efficacement les preuves (et évitez le théâtre de cases à cocher)</h2>Les audits échouent lorsqu’ils s’appuient sur des assurances verbales : « Oui, nous effectuons des sauvegardes. » Votre objectif est de collecter des preuves légères qu’un contrôle existe et est efficace.\r\n\r\nTypes de preuves qui fonctionnent bien pour les PME :<ul><li>Captures d'écran des paramètres clés (MFA appliqué, politique de mot de passe, cryptage de l'appareil).</li><li>Listes exportées (comptes administrateur, rapport d'inscription MFA, liste des intégrations SaaS).</li><li>Exemples de journaux (journaux de connexion, alertes de point de terminaison, refus du pare-feu) couvrant les 7 à 30 derniers jours.</li><li>Tickets ou enregistrements de modifications indiquant les correctifs, les approbations d'accès et les incidents.</li></ul>Comment déguster sans faire bouillir l’océan :<ul><li>Choisissez un échantillon représentatif : 10 à 20 points de terminaison, 3 à 5 serveurs critiques, 5 à 10 applications SaaS clés.</li><li>Échantillonnez par risque : les dirigeants, les finances, les administrateurs informatiques et les utilisateurs distants en premier.</li><li>Valider les « travaux de contrôle » par des tests. Exemple : tenter de vous connecter à un compte test sans MFA ; confirmez qu'il est bloqué.</li></ul>Exemple de « demande de preuves » que vous pouvez envoyer en interne :<ul><li>\"Fournissez la liste des comptes dotés de privilèges d'administrateur globaux et une preuve de l'application de l'AMF.\"</li><li>« Fournissez le dernier enregistrement de test de restauration réussi (date, système, résultat). »</li><li>« Fournissez le rapport sur les correctifs indiquant l'état des correctifs du système d'exploitation et du navigateur pour tous les points de terminaison gérés. »</li></ul><h2 id=\"3-audit-the-controls-that-stop-real-world-sme-incidents\">3) Auditer les contrôles qui arrêtent les incidents réels des PME</h2>La plupart des compromissions des PME remontent à un petit ensemble de défaillances de contrôle : mauvaise hygiène des identités, accès à distance exposé, systèmes non corrigés, sauvegardes médiocres et détection limitée.\r\n\r\nVous trouverez ci-dessous des thèmes d’audit pratiques et ce à quoi ressemble le « bon », sans trop compliquer les choses.<h3 id=\"identity-and-access-especially-admins\">Identité et accès (en particulier les administrateurs)</h3><ul><li>Assurez-vous que l’authentification multifacteur est requise pour tous les utilisateurs et que des exigences plus strictes existent pour les administrateurs.</li><li>Réduisez le nombre de comptes administrateur ; utilisez des identités d’administrateur distinctes pour le travail privilégié.</li><li>Examinez l'accès tiers et les intégrations SaaS (applications OAuth, clés API, comptes de service).</li></ul>Exemple : si une boîte aux lettres financière peut approuver les paiements, vérifiez que le compte dispose de MFA, que les connexions sont enregistrées et que les règles de transfert de la boîte aux lettres sont restreintes et surveillées.<h3 id=\"patching-and-configuration\">Correctifs et configuration</h3><ul><li>Suivez l'état des correctifs pour le système d'exploitation, les navigateurs, les clients VPN et les applications clés.</li><li>Assurez-vous que les systèmes non pris en charge sont identifiés et mis à niveau ou isolés.</li><li>Confirmez les lignes de base de configuration pour les points de terminaison/serveurs : pare-feu activé, chiffrement de disque, gestion à distance sécurisée.</li></ul>Exemple : si vous utilisez des outils d'accès à distance, vérifiez s'ils sont limités aux appareils gérés par l'entreprise et si les journaux sont conservés.<h3 id=\"backups-and-recovery\">Sauvegardes et récupération</h3><ul><li>Validez le principe du « 3-2-1 » (copies multiples, supports multiples, dont une hors ligne/immuable si possible), même si la mise en œuvre est simple.</li><li>Assurez-vous que les sauvegardes incluent les données SaaS sur lesquelles vous comptez (e-mails, partages de fichiers, exportations CRM).</li><li>Exécutez des tests de restauration et documentez les résultats.</li></ul>Exemple : ne vous contentez pas de confirmer que les sauvegardes sont exécutées : restaurez un fichier et une image système pour vérifier la vitesse et l'intégrité.<h3 id=\"logging-and-detection\">Journalisation et détection</h3><ul><li>Centralisez au moins les journaux critiques : connexions du fournisseur d'identité, alertes de point de terminaison, journaux de pare-feu/VPN.</li><li>Assurez-vous que les alertes sont exploitables et acheminées vers un canal surveillé.</li><li>Définissez une « surveillance minimale viable » pour les PME : verrouillages de compte, alertes de voyage impossibles (si disponibles), création d'un nouvel administrateur, règles de boîte de réception suspectes, alertes de rançongiciel/EDR de haute gravité.</li></ul>Exemple : si les alertes sont envoyées vers une boîte aux lettres non surveillée, vous n'avez en réalité aucune détection.<h2 id=\"4-turn-findings-into-a-realistic-remediation-plan\">4) Transformez les résultats en un plan de remédiation réaliste</h2>L’audit n’est utile que s’il génère des améliorations mesurables. Gardez la sortie courte et opérationnelle.\r\n\r\nUne manière pratique de classer les résultats :<ul><li>Gravité : quel est l'impact en cas d'exploitation (perte de données, fraude financière, temps d'arrêt) ?</li><li>Probabilité : est-il exposé à Internet ? Est-ce une voie d'attaque courante ? Est-ce déjà le cas (alertes) ?</li><li>Effort : faible (heures), moyen (jours), élevé (semaines/mois).</li></ul>Rédigez les résultats dans un format que votre équipe peut exécuter :<ul><li>« Problème : MFA non appliqué pour l'accès aux e-mails existants.</li><li>Risque : piratage de compte via pulvérisation de mot de passe.</li><li>Preuve : protocole hérité activé ; les utilisateurs peuvent se connecter sans MFA.</li><li>Correctif : désactivez l'authentification héritée ; appliquer l’AMF ; surveiller les échecs de connexion.</li><li>Propriétaire : Responsable informatique.</li><li>Échéance : 30 jours.</li><li>Vérifier : tester la connexion ; examiner les journaux de connexion.</li></ul>Visez d’abord des gains rapides :<ul><li>Désactivez les comptes inutilisés et les privilèges d’administrateur obsolètes.</li><li>Appliquez la MFA partout.</li><li>Corrigez les systèmes connectés à Internet.</li><li>Exécutez un test de restauration.</li></ul><h2 id=\"checklist\">Liste de contrôle</h2>Utilisez ces 30 questions comme runbook d’audit. Répondez à chacun avec des preuves et capturez une action si la réponse est « Non » ou « Pas sûr ».<ul><li>[ ] Portée : avez-vous défini les systèmes, les réseaux et les magasins de données critiques concernés ?</li><li>[ ] Portée : Connaissez-vous vos 5 principaux ensembles de données « joyaux de la couronne » et à qui appartiennent chacun ?</li><li>[ ] Inventaire : disposez-vous d'un inventaire à jour des points de terminaison, des serveurs et des applications SaaS clés ?</li><li>[ ] Inventaire : pouvez-vous identifier tous les services accessibles sur Internet (VPN, accès à distance, applications Web) ?</li><li>[ ] Identité : la MFA est-elle appliquée pour tous les utilisateurs (pas seulement les administrateurs) sur votre plateforme d'identité/de messagerie principale ?</li><li>[ ] Identité : les privilèges d'administrateur sont-ils minimisés et révisés au moins une fois par trimestre ?</li><li>[ ] Identité : les administrateurs utilisent-ils des comptes distincts pour les tâches privilégiées (pas d'administrateur de pilote quotidien) ?</li><li>[ ] Identité : les comptes partagés sont-ils évités ou, si cela est inévitable, contrôlés par de forts contrôles compensatoires ?</li><li>[ ] Accès : existe-t-il un processus documenté d'arrivée/de déménagement/de départ avec un déprovisionnement en temps opportun ?</li><li>[ ] Accès : les comptes tiers/fournisseurs sont-ils examinés et supprimés lorsqu'ils ne sont plus nécessaires ?</li><li>[ ] E-mail : les règles de transfert de boîtes aux lettres sont-elles restreintes et révisées périodiquement ?</li><li>[ ] Point de terminaison : les points de terminaison de l'entreprise sont-ils chiffrés (disque complet) et protégés par un pare-feu hôte ?</li><li>[ ] Point de terminaison : disposez-vous d'une version/base de référence standard (configuration sécurisée) pour les points de terminaison ?</li><li>[ ] Point de terminaison : existe-t-il une fonctionnalité de protection/détection des points de terminaison déployée sur tous les appareils gérés ?</li><li>[ ] Application de correctifs : disposez-vous d'une politique de correctifs avec des délais (par exemple, critique en jours/semaines) et une preuve d'exécution ?</li><li>[ ] Correction : les systèmes d'exploitation/applications non pris en charge sont-ils identifiés, suivis et activement corrigés ?</li><li>[ ] Réseau : l'accès à distance (VPN/RDP/outils à distance) est-il restreint, surveillé et protégé par MFA ?</li><li>[ ] Réseau : les mots de passe par défaut sont-ils supprimés et les interfaces de gestion des appareils ne sont-elles pas exposées à Internet ?</li><li>[ ] Données : les données sensibles sont-elles classées ou au moins étiquetées par type et emplacement (même de manière informelle) ?</li><li>[ ] Données : les autorisations de partage de fichiers/stockage cloud sont-elles examinées en cas d'accès excessif (par exemple, « Tout le monde ») ?</li><li>[ ] Données : les secrets (clés API, mots de passe) sont-ils stockés dans des emplacements approuvés (pas dans des feuilles de calcul/e-mail) ?</li><li>[ ] Sauvegardes : les sauvegardes couvrent-elles les serveurs critiques et les données SaaS critiques (e-mails/fichiers/CRM, le cas échéant) ?</li><li>[ ] Sauvegardes : les sauvegardes sont-elles protégées contre la suppression/la falsification (informations d'identification distinctes, hors ligne/immuables si possible) ?</li><li>[ ] Sauvegardes : avez-vous effectué et documenté un test de restauration au cours des 90 derniers jours ?</li><li>[ ] Journalisation : les journaux de connexion, les modifications de l'administrateur et les alertes de point de terminaison sont-ils conservés et consultables ?</li><li>[ ] Journalisation : les alertes sont-elles envoyées vers un canal surveillé avec un contact de garde/de secours ?</li><li>[ ] Préparation aux incidents : disposez-vous d'une liste de contrôle de réponse aux incidents avec les contacts et les étapes clés ?</li><li>[ ] Préparation aux incidents : avez-vous organisé un exercice de simulation au cours de la dernière année (même 30 minutes) ?</li><li>[ ] Contrôle des modifications : les modifications majeures (nouveau SaaS, nouvelles règles de pare-feu, nouveaux administrateurs) sont-elles enregistrées et approuvées ?</li><li>[ ] Risque : Tenez-vous un registre des risques simple avec les propriétaires et les dates de remédiation pour les principales constatations ?</li></ul><h2 id=\"faq\">FAQ</h2><strong>1) À quelle fréquence une PME doit-elle réaliser un audit de sécurité comme celui-ci ?</strong>Une cadence trimestrielle est une cadence pratique, ainsi qu'après des changements majeurs (nouveaux systèmes, fusions, grands changements de réseau) ou après un incident.<strong>2) Quelle est la différence entre un audit et une analyse de vulnérabilité ?</strong>Une analyse de vulnérabilité révèle des faiblesses techniques ; un audit vérifie si les contrôles et processus de sécurité clés existent, fonctionnent et sont prouvés."
  }
}