{
  "slug": "internal-security-audit-checklist-small-it-teams",
  "metadata": {
    "title": "Internal Security Audit Checklist Small It Teams",
    "description": "Security insights for small and mid-sized businesses",
    "date": "2026-01-19",
    "pillar": "SOC",
    "tags": [
      "SME",
      "Security"
    ]
  },
  "translatedMetadata": {
    "fr": {
      "title": "Liste de contrôle pour l'audit de sécurité interne Petites équipes informatiques",
      "description": "Informations sur la sécurité pour les petites et moyennes entreprises",
      "date": "2026-01-19",
      "pillar": "SOC",
      "tags": [
        "PME",
        "Sécurité"
      ]
    }
  },
  "content": "<h2 id=\"intro\">Intro</h2>\r\nInternal security audits don’t have to be “big company” projects. For small IT teams, the goal is to confirm that everyday controls are actually working, not to produce a perfect report. A lightweight, repeatable audit helps you catch gaps before an attacker (or an outage) does. This post gives you a practical checklist and a simple way to run it quarterly—without buying new tools.\r\n\r\n<h2 id=\"quick-take\">Quick take</h2>\r\n<ul>\n<li>Focus on high-impact areas first: identity, patching, backups, and endpoint security.</li>\n<li>Audit what’s real, not what’s written: validate with spot checks and evidence.</li>\n<li>Keep scope small: pick a handful of systems and users each cycle.</li>\n<li>Track findings as tickets with owners and due dates, not as a static document.</li>\n<li>Re-audit closed items to confirm the fix actually reduced risk.</li>\n</ul>\n\r\n<h2 id=\"build-a-lightweight-audit-plan-scope-timing-evidence\">Build a lightweight audit plan (scope, timing, evidence)</h2>\r\nA small team can’t audit everything at once. Instead, define a tight scope and rotate.\r\n\r\n<h3 id=\"1-pick-a-cadence-you-can-sustain\">1) Pick a cadence you can sustain</h3>\r\n<ul>\n<li>Monthly “mini-audit” (30–60 minutes): one topic (e.g., MFA coverage).</li>\n<li>Quarterly audit (half-day to one day): identity + patching + backups + endpoints.</li>\n<li>Annual deeper dive: vendor access, network segmentation, incident response tabletop.</li>\n</ul>\n\r\n<h3 id=\"2-define-the-audit-scope-in-one-paragraph\">2) Define the audit scope in one paragraph</h3>\r\nExample scope statement:\r\n“Review identity controls for Microsoft 365 and VPN, patch status for Windows endpoints and two critical servers, backup restore capability for the file share, and admin access to core systems.”\r\n\r\n<h3 id=\"3-decide-what-counts-as-evidence\">3) Decide what counts as evidence</h3>\r\nAvoid long narratives. Use simple, verifiable artifacts:\r\n<ul>\n<li>Screenshots of settings pages</li>\n<li>Exported user lists (admins, MFA status)</li>\n<li>Patch reports / update history</li>\n<li>Backup job logs plus a restore test record</li>\n<li>Ticket IDs for remediation actions</li>\n</ul>\n\r\n<h3 id=\"4-use-sampling-to-stay-sane\">4) Use sampling to stay sane</h3>\r\nIf you have 120 endpoints, don’t inspect all 120.\r\n<ul>\n<li>Sample 10 endpoints across departments</li>\n<li>Sample 10 user accounts (including at least 2 executives and 2 contractors)</li>\n<li>Sample 2 critical servers and 1 “forgotten” server</li>\n</ul>\n\r\nPractical tip: Keep an “audit notebook” in a shared folder with dated subfolders. Store only what you need (and protect it—these artifacts can be sensitive).\r\n\r\n<h2 id=\"identity-and-access-verify-the-controls-that-stop-most-breaches\">Identity and access: verify the controls that stop most breaches</h2>\r\nIdentity is the control plane for cloud apps, VPN, and admin tools. Small misconfigurations here can undo strong endpoint protection.\r\n\r\nWhat to check\r\n<h3 id=\"1-mfa-coverage-and-exceptions\">1) MFA coverage and exceptions</h3>\r\n<ul>\n<li>Verify MFA is enabled for all users, especially email and remote access.</li>\n<li>List any exceptions (service accounts, break-glass accounts) and confirm compensating controls.</li>\n</ul>\n\r\nExample evidence\r\n<ul>\n<li>Export from your IdP showing MFA status.</li>\n<li>A short note documenting why a service account can’t use MFA and how it’s protected (e.g., long random password in a vault, restricted sign-in locations).</li>\n</ul>\n\r\n<h3 id=\"2-admin-accounts-and-privilege-boundaries\">2) Admin accounts and privilege boundaries</h3>\r\n<ul>\n<li>Ensure admins use separate accounts for administrative tasks.</li>\n<li>Confirm least privilege: who is global admin, domain admin, local admin?</li>\n</ul>\n\r\nExample spot check\r\n<ul>\n<li>Pick two admins and confirm:</li>\n<li>Their day-to-day account is not an admin</li>\n<li>Admin account has MFA</li>\n<li>Admin sign-in logs show expected behavior</li>\n</ul>\n\r\n<h3 id=\"3-offboarding-and-contractor-access\">3) Offboarding and contractor access</h3>\r\n<ul>\n<li>Validate a recent offboarding case end-to-end: account disabled, tokens revoked, groups removed, mailbox access handled, VPN removed.</li>\n</ul>\n\r\nExample\r\n<ul>\n<li>Choose one terminated user from the last 60 days. Confirm the disable timestamp and last successful login are aligned with policy.</li>\n</ul>\n\r\n<h3 id=\"4-password-policy-and-account-recovery\">4) Password policy and account recovery</h3>\r\n<ul>\n<li>Confirm password policy is reasonable and consistent.</li>\n<li>Review how users reset passwords (helpdesk workflow, identity verification).</li>\n</ul>\n\r\nFramework hint (generic)\r\nIf you map to CIS/NIST/ISO later, this identity work aligns with common access control and authentication control families—but don’t treat this audit as a “compliance” exercise.\r\n\r\n<h2 id=\"systems-and-patching-prove-you-can-keep-up-with-known-vulnerabilities\">Systems and patching: prove you can keep up with known vulnerabilities</h2>\r\nPatching is where small teams get overwhelmed. The audit should surface bottlenecks and unmanaged assets.\r\n\r\nWhat to check\r\n<h3 id=\"1-asset-inventory-accuracy\">1) Asset inventory accuracy</h3>\r\n<ul>\n<li>Can you produce a list of laptops, desktops, servers, and key SaaS admins?</li>\n<li>Identify unmanaged or unknown devices.</li>\n</ul>\n\r\nExample\r\n<ul>\n<li>Compare your endpoint management list to DHCP leases or your purchasing records. Any “ghost” devices are audit findings.</li>\n</ul>\n\r\n<h3 id=\"2-patch-slas-service-level-targets\">2) Patch SLAs (service level targets)</h3>\r\nDefine simple targets (internal goals) and audit against them:\r\n<ul>\n<li>Critical security updates: within 14 days</li>\n<li>High: within 30 days</li>\n<li>Third-party apps (browsers, PDF readers): within 14–30 days</li>\n</ul>\n\r\nNo need to cite stats; just pick targets you can meet and improve.\r\n\r\n<h3 id=\"3-server-patching-and-reboot-reality\">3) Server patching and reboot reality</h3>\r\n<ul>\n<li>Confirm servers actually reboot when needed.</li>\n<li>Validate maintenance windows exist and are used.</li>\n</ul>\n\r\nExample evidence\r\n<ul>\n<li>Update history showing last security update and last reboot time for two critical servers.</li>\n</ul>\n\r\n<h3 id=\"4-vulnerability-scanning-optional\">4) Vulnerability scanning (optional)</h3>\r\nIf you already have a scanner, use it. If not, focus on patch posture and exposed services.\r\n<ul>\n<li>Verify no unnecessary remote management interfaces are internet-exposed.</li>\n<li>Confirm remote access (VPN/RDP/SSH) is restricted.</li>\n</ul>\n\r\n<h2 id=\"endpoints-email-and-data-protection-check-the-basics-that-reduce-impact\">Endpoints, email, and data protection: check the basics that reduce impact</h2>\r\nYou’re auditing preventative controls (stop attacks) and detective controls (notice them).\r\n\r\nWhat to check\r\n<h3 id=\"1-endpoint-protection-and-disk-encryption\">1) Endpoint protection and disk encryption</h3>\r\n<ul>\n<li>Confirm EDR/AV is installed and healthy on the sampled endpoints.</li>\n<li>Confirm full-disk encryption is enabled on laptops.</li>\n</ul>\n\r\nExample spot check\r\n<ul>\n<li>On 5 sampled laptops: verify protection status is “active,” definitions current, and encryption is on.</li>\n</ul>\n\r\n<h3 id=\"2-email-protections-and-risky-settings\">2) Email protections and risky settings</h3>\r\n<ul>\n<li>Confirm anti-phishing and spam filtering are enabled.</li>\n<li>Check whether auto-forwarding to external addresses is blocked or controlled.</li>\n</ul>\n\r\nExample\r\n<ul>\n<li>Search for mailbox rules that forward externally. Any unapproved forwarding is a high-priority finding.</li>\n</ul>\n\r\n<h3 id=\"3-data-classification-simple-and-sharing-controls\">3) Data classification (simple) and sharing controls</h3>\r\nYou don’t need a complex scheme. Start with:\r\n<ul>\n<li>Public (ok to share)</li>\n<li>Internal (default)</li>\n<li>Restricted (client data, financials, credentials)</li>\n</ul>\n\r\nAudit actions\r\n<ul>\n<li>Confirm restricted data isn’t stored in unmanaged locations.</li>\n<li>Review sharing links for a sample of sensitive folders.</li>\n</ul>\n\r\n<h3 id=\"4-logging-coverage\">4) Logging coverage</h3>\r\n<ul>\n<li>Confirm you can access logs for identity sign-ins, endpoint alerts, and admin actions.</li>\n<li>Confirm log retention meets your operational needs (even 30–90 days is better than “unknown”).</li>\n</ul>\n\r\n<h2 id=\"backups-and-incident-readiness-demonstrate-you-can-recover-and-respond\">Backups and incident readiness: demonstrate you can recover and respond</h2>\r\nBackups that have never been restored are hope, not a control. Your audit should include at least one restore test.\r\n\r\nWhat to check\r\n<h3 id=\"1-backup-scope\">1) Backup scope</h3>\r\n<ul>\n<li>Identify your “crown jewel” systems: file shares, finance app, CRM data, email, key databases.</li>\n<li>Confirm each has a backup method and owner.</li>\n</ul>\n\r\n<h3 id=\"2-restore-test\">2) Restore test</h3>\r\n<ul>\n<li>Perform one restore test per quarter (rotate systems).</li>\n<li>Document: what you restored, where, how long it took, and what broke.</li>\n</ul>\n\r\nExample restore test record\r\n<ul>\n<li>“Restored last night’s backup of the finance shared folder to an isolated location; validated 10 random files opened; restore time 22 minutes; permissions required adjustment.”</li>\n</ul>\n\r\n<h3 id=\"3-ransomware-resilience-basics\">3) Ransomware resilience basics</h3>\r\n<ul>\n<li>Confirm at least one backup copy is protected from routine admin credentials (separate account, separate system, or immutability if available).</li>\n<li>Confirm backup delete permissions are limited.</li>\n</ul>\n\r\n<h3 id=\"4-incident-response-essentials\">4) Incident response essentials</h3>\r\n<ul>\n<li>Verify you have an incident contact list and escalation path.</li>\n<li>Run a 30-minute tabletop exercise once or twice per year.</li>\n</ul>\n\r\nExample tabletop scenario\r\n<ul>\n<li>“User reports MFA push fatigue attempts and suspicious email rule creation.”</li>\n<li>Validate who disables the account, who checks mailbox rules, who communicates internally, and how you preserve evidence.</li>\n</ul>\n\r\n<h2 id=\"checklist\">Checklist</h2>\r\n<ul>\n<li>[ ] Define audit scope (systems, users, and time period) and store it with the audit date.</li>\n<li>[ ] Export admin account list and confirm least privilege (remove unnecessary admin roles).</li>\n<li>[ ] Verify MFA coverage for all users and document any exceptions with compensating controls.</li>\n<li>[ ] Validate offboarding for one recent departure (account disabled, access removed, tokens revoked).</li>\n<li>[ ] Sample 10 endpoints to confirm EDR/AV healthy, disk encryption enabled, and OS version supported.</li>\n<li>[ ] Review patch posture for two critical servers and confirm last security update + last reboot time.</li>\n<li>[ ] Identify unmanaged assets by comparing endpoint inventory to another source (network/DHCP/purchasing).</li>\n<li>[ ] Check for risky email settings (external auto-forwarding, suspicious inbox rules) and remediate.</li>\n<li>[ ] Confirm backup coverage for crown jewel systems and run one documented restore test.</li>\n<li>[ ] Verify logging access and retention for identity, endpoints, and admin activity; ensure alerts reach the right mailbox/on-call.</li>\n</ul>\n\r\n<h2 id=\"faq\">FAQ</h2>\r\nQ1: How often should a small IT team run an internal security audit?\r\nA: Do a small monthly check on one topic and a broader quarterly review of identity, patching, endpoints, and backups.\r\n\r\nQ2: Do we need specialized audit software to do this well?\r\nA: No. A ticketing system, a shared folder for evidence, and exports/screenshots from existing tools are enough to start.\r\n\r\nQ3: What’s the most common “high severity” finding in small environments?\r\nA: Gaps in identity controls—missing MFA, too many admins, or incomplete offboarding—because they directly enable account takeover.",
  "translatedContent": {
    "fr": "<h2 id=\"intro\">Introduction</h2>Les audits de sécurité interne ne doivent pas nécessairement être des projets de « grande entreprise ». Pour les petites équipes informatiques, l’objectif est de confirmer que les contrôles quotidiens fonctionnent réellement, et non de produire un rapport parfait. Un audit léger et reproductible vous aide à détecter les lacunes avant qu'un attaquant (ou une panne) ne le fasse. Cet article vous propose une liste de contrôle pratique et un moyen simple de l'exécuter chaque trimestre, sans acheter de nouveaux outils.<h2 id=\"quick-take\">Prise rapide</h2><ul><li>Concentrez-vous d'abord sur les domaines à fort impact : l'identité, les correctifs, les sauvegardes et la sécurité des points finaux.</li><li>Vérifiez ce qui est réel, pas ce qui est écrit : validez avec des contrôles ponctuels et des preuves.</li><li>Gardez la portée réduite : choisissez une poignée de systèmes et d’utilisateurs à chaque cycle.</li><li>Suivez les résultats sous forme de tickets avec les propriétaires et les dates d'échéance, et non sous la forme d'un document statique.</li><li>Ré-auditez les éléments clôturés pour confirmer que le correctif a réellement réduit le risque.</li></ul><h2 id=\"build-a-lightweight-audit-plan-scope-timing-evidence\">Construire un plan d’audit léger (portée, calendrier, preuves)</h2>Une petite équipe ne peut pas tout auditer en même temps. Au lieu de cela, définissez une portée étroite et effectuez une rotation.<h3 id=\"1-pick-a-cadence-you-can-sustain\">1) Choisissez une cadence que vous pouvez maintenir</h3><ul><li>« Mini-audit » mensuel (30 à 60 minutes) : un sujet (par exemple, la couverture MFA).</li><li>audit trimestriel (demi-journée à une journée) : identité + patching + sauvegardes + endpoints.</li><li>Approfondissement annuel : accès aux fournisseurs, segmentation du réseau, table de réponse aux incidents.</li></ul><h3 id=\"2-define-the-audit-scope-in-one-paragraph\">2) Définir la portée de l'audit en un seul paragraphe</h3>Exemple d'énoncé de portée :\r\n« Examinez les contrôles d'identité pour Microsoft 365 et VPN, l'état des correctifs pour les points de terminaison Windows et deux serveurs critiques, la capacité de restauration de sauvegarde pour le partage de fichiers et l'accès administrateur aux systèmes principaux.<h3 id=\"3-decide-what-counts-as-evidence\">3) Décidez de ce qui compte comme preuve</h3>Évitez les longs récits. Utilisez des artefacts simples et vérifiables :<ul><li>Captures d'écran des pages de paramètres</li><li>Listes d'utilisateurs exportées (administrateurs, statut MFA)</li><li>Rapports de correctifs/historique des mises à jour</li><li>Journaux de tâches de sauvegarde et enregistrement de test de restauration</li><li>ID de ticket pour les actions correctives</li></ul><h3 id=\"4-use-sampling-to-stay-sane\">4) Utilisez l’échantillonnage pour rester sain d’esprit</h3>Si vous disposez de 120 points de terminaison, n’inspectez pas tous les 120.<ul><li>Échantillon de 10 points de terminaison dans tous les départements</li><li>Échantillon de 10 comptes d'utilisateurs (dont au moins 2 cadres et 2 sous-traitants)</li><li>Exemple de 2 serveurs critiques et 1 serveur « oublié »</li></ul>Conseil pratique : Conservez un « carnet d’audit » dans un dossier partagé comportant des sous-dossiers datés. Stockez uniquement ce dont vous avez besoin (et protégez-le : ces artefacts peuvent être sensibles).<h2 id=\"identity-and-access-verify-the-controls-that-stop-most-breaches\">Identité et accès : vérifiez les contrôles qui bloquent la plupart des violations</h2>L'identité est le plan de contrôle des applications cloud, du VPN et des outils d'administration. De petites erreurs de configuration peuvent annuler une protection renforcée des points de terminaison.\r\n\r\nQue vérifier<h3 id=\"1-mfa-coverage-and-exceptions\">1) Couverture MFA et exceptions</h3><ul><li>Vérifiez que MFA est activé pour tous les utilisateurs, en particulier la messagerie électronique et l'accès à distance.</li><li>Répertoriez les exceptions (comptes de service, comptes bris de glace) et confirmez les contrôles compensatoires.</li></ul>Exemple de preuve<ul><li>Exportez depuis votre IdP en affichant le statut MFA.</li><li>Une courte note expliquant pourquoi un compte de service ne peut pas utiliser MFA et comment il est protégé (par exemple, un mot de passe long et aléatoire dans un coffre-fort, des emplacements de connexion restreints).</li></ul><h3 id=\"2-admin-accounts-and-privilege-boundaries\">2) Comptes d'administrateur et limites de privilèges</h3><ul><li>Assurez-vous que les administrateurs utilisent des comptes distincts pour les tâches administratives.</li><li>Confirmer le moindre privilège : qui est l'administrateur global, l'administrateur de domaine, l'administrateur local ?</li></ul>Exemple de contrôle ponctuel<ul><li>Choisissez deux administrateurs et confirmez :</li><li>Leur compte quotidien n'est pas un administrateur</li><li>Le compte administrateur dispose d'un MFA</li><li>Les journaux de connexion de l'administrateur affichent le comportement attendu</li></ul><h3 id=\"3-offboarding-and-contractor-access\">3) Démarrage et accès des entrepreneurs</h3><ul><li>Validez de bout en bout un cas d'exclusion récent : compte désactivé, jetons révoqués, groupes supprimés, accès à la boîte aux lettres géré, VPN supprimé.</li></ul>Exemple<ul><li>Choisissez un utilisateur résilié au cours des 60 derniers jours. Confirmez que l'horodatage de désactivation et la dernière connexion réussie sont conformes à la stratégie.</li></ul><h3 id=\"4-password-policy-and-account-recovery\">4) Politique de mot de passe et récupération de compte</h3><ul><li>Confirmez que la politique de mot de passe est raisonnable et cohérente.</li><li>Examinez la façon dont les utilisateurs réinitialisent les mots de passe (workflow du service d'assistance, vérification de l'identité).</li></ul>Astuce de cadre (générique)\r\nSi vous effectuez un mappage vers CIS/NIST/ISO ultérieurement, ce travail d'identité s'aligne sur les familles courantes de contrôle d'accès et de contrôle d'authentification, mais ne considérez pas cet audit comme un exercice de « conformité ».<h2 id=\"systems-and-patching-prove-you-can-keep-up-with-known-vulnerabilities\">Systèmes et correctifs : prouvez que vous pouvez suivre les vulnérabilités connues</h2>C'est avec l'application de correctifs que les petites équipes sont submergées. L’audit doit mettre en évidence les goulots d’étranglement et les actifs non gérés.\r\n\r\nQue vérifier<h3 id=\"1-asset-inventory-accuracy\">1) Exactitude de l’inventaire des actifs</h3><ul><li>Pouvez-vous produire une liste des ordinateurs portables, des ordinateurs de bureau, des serveurs et des principaux administrateurs SaaS ?</li><li>Identifiez les appareils non gérés ou inconnus.</li></ul>Exemple<ul><li>Comparez votre liste de gestion des points de terminaison aux baux DHCP ou à vos enregistrements d'achats. Tous les appareils « fantômes » sont des résultats d’audit.</li></ul><h3 id=\"2-patch-slas-service-level-targets\">2) Corriger les SLA (objectifs de niveau de service)</h3>Définissez des objectifs simples (objectifs internes) et auditez-les :<ul><li>Mises à jour de sécurité critiques : dans les 14 jours</li><li>Élevé : dans les 30 jours</li><li>Applications tierces (navigateurs, lecteurs PDF) : dans un délai de 14 à 30 jours</li></ul>Pas besoin de citer des statistiques ; choisissez simplement des objectifs que vous pouvez atteindre et améliorer.<h3 id=\"3-server-patching-and-reboot-reality\">3) Correction du serveur et redémarrage de la réalité</h3><ul><li>Confirmez que les serveurs redémarrent réellement en cas de besoin.</li><li>Vérifiez que les fenêtres de maintenance existent et sont utilisées.</li></ul>Exemple de preuve<ul><li>Historique des mises à jour affichant la dernière mise à jour de sécurité et l'heure du dernier redémarrage pour deux serveurs critiques.</li></ul><h3 id=\"4-vulnerability-scanning-optional\">4) Analyse des vulnérabilités (facultatif)</h3>Si vous possédez déjà un scanner, utilisez-le. Sinon, concentrez-vous sur la posture des correctifs et les services exposés.<ul><li>Vérifiez qu’aucune interface de gestion à distance inutile n’est exposée à Internet.</li><li>Confirmez que l'accès à distance (VPN/RDP/SSH) est restreint.</li></ul><h2 id=\"endpoints-email-and-data-protection-check-the-basics-that-reduce-impact\">Points de terminaison, messagerie et protection des données : vérifiez les principes de base qui réduisent l'impact</h2>Vous auditez les contrôles préventifs (arrêter les attaques) et les contrôles de détection (les remarquer).\r\n\r\nQue vérifier<h3 id=\"1-endpoint-protection-and-disk-encryption\">1) Protection des points finaux et chiffrement du disque</h3><ul><li>Confirmez qu’EDR/AV est installé et sain sur les points de terminaison échantillonnés.</li><li>Vérifiez que le chiffrement complet du disque est activé sur les ordinateurs portables.</li></ul>Exemple de contrôle ponctuel<ul><li>Sur 5 ordinateurs portables échantillonnés : vérifiez que l'état de la protection est « actif », que les définitions sont à jour et que le cryptage est activé.</li></ul><h3 id=\"2-email-protections-and-risky-settings\">2) Protections de messagerie et paramètres à risque</h3><ul><li>Vérifiez que l'anti-hameçonnage et le filtrage anti-spam sont activés.</li><li>Vérifiez si le transfert automatique vers des adresses externes est bloqué ou contrôlé.</li></ul>Exemple<ul><li>Recherchez les règles de boîte aux lettres qui transmettent en externe. Tout transfert non approuvé constitue une découverte hautement prioritaire.</li></ul><h3 id=\"3-data-classification-simple-and-sharing-controls\">3) Classification des données (simple) et contrôles de partage</h3>Vous n’avez pas besoin d’un schéma complexe. Commencez par :<ul><li>Public (ok pour partager)</li><li>Interne (par défaut)</li><li>Restreint (données client, données financières, informations d'identification)</li></ul>Actions d'audit<ul><li>Vérifiez que les données restreintes ne sont pas stockées dans des emplacements non gérés.</li><li>Examinez les liens de partage pour un échantillon de dossiers sensibles.</li></ul><h3 id=\"4-logging-coverage\">4) Couverture forestière</h3><ul><li>Confirmez que vous pouvez accéder aux journaux pour les connexions d'identité, les alertes de point de terminaison et les actions d'administrateur.</li><li>Confirmez que la conservation des journaux répond à vos besoins opérationnels (même 30 à 90 jours vaut mieux que « inconnu »).</li></ul><h2 id=\"backups-and-incident-readiness-demonstrate-you-can-recover-and-respond\">Sauvegardes et préparation aux incidents : démontrez que vous pouvez récupérer et réagir</h2>Les sauvegardes qui n'ont jamais été restaurées sont un espoir, pas un contrôle. Votre audit doit inclure au moins un test de restauration.\r\n\r\nQue vérifier<h3 id=\"1-backup-scope\">1) Portée de la sauvegarde</h3><ul><li>Identifiez vos systèmes « joyaux de la couronne » : partages de fichiers, application financière, données CRM, courrier électronique, bases de données clés.</li><li>Confirmez que chacun a une méthode de sauvegarde et un propriétaire.</li></ul><h3 id=\"2-restore-test\">2) Test de restauration</h3><ul><li>Effectuez un test de restauration par trimestre (rotation des systèmes).</li><li>Documentez : ce que vous avez restauré, où, combien de temps cela a pris et ce qui s'est cassé.</li></ul>Exemple d'enregistrement de test de restauration<ul><li>\"Sauvegarde de la nuit dernière du dossier partagé financier dans un emplacement isolé ; validation de 10 fichiers aléatoires ouverts ; temps de restauration de 22 minutes ; ajustement des autorisations requis.\"</li></ul><h3 id=\"3-ransomware-resilience-basics\">3) Bases de la résilience aux ransomwares</h3><ul><li>Confirmez qu'au moins une copie de sauvegarde est protégée des informations d'identification d'administrateur de routine (compte distinct, système distinct ou immuabilité si disponible).</li><li>Confirmez que les autorisations de suppression de sauvegarde sont limitées.</li></ul><h3 id=\"4-incident-response-essentials\">4) Éléments essentiels de la réponse aux incidents</h3><ul><li>Vérifiez que vous disposez d’une liste de contacts en cas d’incident et d’un chemin d’escalade.</li><li>Organisez un exercice sur table de 30 minutes une ou deux fois par an.</li></ul>Exemple de scénario de table<ul><li>« Les utilisateurs signalent des tentatives de fatigue push MFA et la création de règles de messagerie suspectes. »</li><li>Vérifiez qui désactive le compte, qui vérifie les règles de la boîte aux lettres, qui communique en interne et comment vous conservez les preuves.</li></ul><h2 id=\"checklist\">Liste de contrôle</h2><ul><li>[ ] Définissez la portée de l'audit (systèmes, utilisateurs et période) et stockez-la avec la date de l'audit.</li><li>[ ] Exportez la liste des comptes administrateur et confirmez le moindre privilège (supprimez les rôles d'administrateur inutiles).</li><li>[ ] Vérifiez la couverture MFA pour tous les utilisateurs et documentez toutes les exceptions avec des contrôles compensatoires.</li><li>[ ] Valider l'offboarding pour un départ récent (compte désactivé, accès supprimé, tokens révoqués).</li><li>[ ] Échantillon de 10 points de terminaison pour confirmer l'intégrité d'EDR/AV, le chiffrement de disque activé et la version du système d'exploitation prise en charge.</li><li>[ ] Vérifiez l'état des correctifs pour deux serveurs critiques et confirmez la dernière mise à jour de sécurité + l'heure du dernier redémarrage.</li><li>[ ] Identifiez les actifs non gérés en comparant l'inventaire des points de terminaison à une autre source (réseau/DHCP/achats).</li><li>[ ] Vérifiez les paramètres de messagerie à risque (redirection automatique externe, règles de boîte de réception suspectes) et corrigez-les.</li><li>[ ] Confirmez la couverture de sauvegarde pour les systèmes joyaux de la couronne et exécutez un test de restauration documenté.</li><li>[ ] Vérifier l'accès à la journalisation et la conservation de l'identité, des points de terminaison et de l'activité d'administration ; assurez-vous que les alertes parviennent à la bonne boîte aux lettres/sur appel.</li></ul><h2 id=\"faq\">FAQ</h2>Q1 : À quelle fréquence une petite équipe informatique doit-elle effectuer un audit de sécurité interne ?\r\nR : Effectuez une petite vérification mensuelle sur un sujet et un examen trimestriel plus large de l'identité, des correctifs, des points de terminaison et des sauvegardes.\r\n\r\nQ2 : Avons-nous besoin d’un logiciel d’audit spécialisé pour bien faire cela ?\r\nR : Non. Un système de tickets, un dossier partagé pour les preuves et des exportations/captures d'écran à partir d'outils existants suffisent pour démarrer.\r\n\r\nQ3 : Quel est le résultat de « gravité élevée » le plus courant dans les petits environnements ?\r\nR : Lacunes dans les contrôles d'identité (MFA manquante, trop d'administrateurs ou exclusion incomplète), car ils permettent directement la prise de contrôle de compte."
  }
}