{
  "slug": "secure-first-aws-account-day-one-settings",
  "metadata": {
    "title": "Secure First Aws Account Day One Settings",
    "description": "Security insights for small and mid-sized businesses",
    "date": "2026-01-19",
    "pillar": "SOC",
    "tags": [
      "SME",
      "Security"
    ]
  },
  "translatedMetadata": {
    "fr": {
      "title": "Sécurisez les premiers paramètres du premier jour du compte AWS",
      "description": "Informations sur la sécurité pour les petites et moyennes entreprises",
      "date": "2026-01-19",
      "pillar": "SOC",
      "tags": [
        "PME",
        "Sécurité"
      ]
    }
  },
  "content": "<h2 id=\"intro\">Intro</h2>\r\nSpinning up your first AWS account is exciting—until you realize the default posture is “ready to build,” not “ready for attackers.” Day-one security work is mostly configuration, not code, and it pays off immediately by reducing the blast radius of mistakes. For SMEs, the goal isn’t perfection; it’s creating basic guardrails so teams can move fast without leaving obvious doors open. This post walks through 10 settings to check on day one, with practical examples you can implement in under a few hours.\r\n\r\n<h2 id=\"quick-take\">Quick take</h2>\r\n<ul>\n<li>Enable MFA on the root user, then stop using root for daily work.</li>\n<li>Create an admin role for humans and use least-privilege IAM policies for everything else.</li>\n<li>Turn on organization-wide logging (CloudTrail) and centralize logs early.</li>\n<li>Add cost and security guardrails (Budgets + alerts; basic detection services).</li>\n<li>Enforce encryption and safe defaults (S3 block public access, EBS encryption by default).</li>\n</ul>\n\r\n<h2 id=\"1-lock-down-identity-root-mfa-and-an-admin-role\">1) Lock down identity: root, MFA, and an admin role</h2>\r\nYour AWS account’s “root user” is the keys-to-the-kingdom identity. Treat it like a break-glass account.\r\n\r\n1) Enable root MFA (hardware key or authenticator app).\r\n<ul>\n<li>Action: Sign in as root once, set up MFA, and store recovery codes securely.</li>\n<li>Example: Put break-glass instructions in your password manager with restricted access (e.g., two IT managers).</li>\n</ul>\n\r\n2) Stop using root for normal tasks.\r\n<ul>\n<li>Action: Create an IAM admin role and use that role for administration.</li>\n<li>Example: Create an IAM user (or better, federate from your identity provider later), grant it permission to assume an “Admin” role, then enforce MFA on that user.</li>\n</ul>\n\r\n3) Use roles over long-lived access keys.\r\n<ul>\n<li>Why: Access keys leak. Roles reduce key sprawl and make it easier to rotate access.</li>\n<li>Example: If a CI system needs AWS access, give it a role via AWS-native mechanisms (such as instance roles / task roles) rather than copying keys into environment variables.</li>\n</ul>\n\r\n4) Set an account password policy (if you use IAM users).\r\n<ul>\n<li>Action: Require long passwords and disallow password reuse. Even if you plan to migrate to SSO soon, a password policy helps during the transition.</li>\n</ul>\n\r\nPractical tip: In SMEs, the biggest identity risk early on is “everyone is an admin forever.” Start with one admin role, then create separate roles for billing-only, read-only, and deployment.\r\n\r\n<h2 id=\"2-establish-least-privilege-with-iam-baselines-and-guardrails\">2) Establish least privilege with IAM baselines and guardrails</h2>\r\nOnce identity is controlled, permissions are the next largest source of risk.\r\n\r\n1) Avoid using the default “AdministratorAccess” policy for day-to-day engineering.\r\n<ul>\n<li>Action: Create role-based access patterns: Admin, PowerUser/DevOps, ReadOnly, Billing.</li>\n<li>Example: Developers can be allowed to deploy into specific environments (like “dev”) but not change account-wide settings.</li>\n</ul>\n\r\n2) Use groups and roles to keep access reviewable.\r\n<ul>\n<li>Action: Put users into groups (if using IAM users) or map SSO groups to roles.</li>\n<li>Example: “IT-Managers” group can assume Admin; “Finance” can assume Billing role.</li>\n</ul>\n\r\n3) Add a basic permission boundary pattern.\r\n<ul>\n<li>Why: Boundaries prevent a mistake where someone creates a policy that accidentally grants overly broad permissions.</li>\n<li>Example: Apply a boundary that blocks risky actions like disabling CloudTrail, modifying key security services, or making S3 buckets public (even if you later fine-tune it).</li>\n</ul>\n\r\n4) Turn on IAM Access Analyzer.\r\n<ul>\n<li>What it does: Highlights resources that can be accessed from outside your account (e.g., S3 buckets, KMS keys, IAM roles with external trust).</li>\n<li>Example: If you see an S3 bucket policy allowing “Principal: *” or broad cross-account access, fix it before it becomes a data exposure incident.</li>\n</ul>\n\r\nPractical tip: Least privilege is a journey. Your day-one goal is to prevent obvious overexposure and to make permissions auditable. You can tighten policies as you learn what workloads actually need.\r\n\r\n<h2 id=\"3-turn-on-logging-and-monitoring-before-you-deploy-workloads\">3) Turn on logging and monitoring before you deploy workloads</h2>\r\nWhen something goes wrong, logs are the difference between “we think…” and “we know.” Enable them now—before the first instance, database, or bucket goes live.\r\n\r\n1) Enable AWS CloudTrail across all regions.\r\n<ul>\n<li>Action: Create an organization/account-level trail that logs management events and writes to a dedicated S3 bucket.</li>\n<li>Example: If someone changes a security group to allow 0.0.0.0/0 on port 22, CloudTrail can show who did it and when.</li>\n</ul>\n\r\n2) Secure the log bucket.\r\n<ul>\n<li>Action: Block public access, restrict write permissions to the logging service, and consider a separate “logs” account later.</li>\n<li>Example: Use S3 bucket policies that only allow CloudTrail to write and your security admins to read.</li>\n</ul>\n\r\n3) Enable CloudWatch alarms for obvious signals.\r\n<ul>\n<li>Examples:</li>\n<li>Alarm on root account usage.</li>\n<li>Alarm on IAM policy changes.</li>\n<li>Alarm on CloudTrail being stopped or altered.</li>\n</ul>\n\r\n4) Turn on at least one baseline detection service.\r\n<ul>\n<li>Options include AWS-native threat detection and configuration monitoring services.</li>\n<li>Goal: Get actionable findings, not noise. Start with defaults, then tune.</li>\n</ul>\n\r\nPractical tip: If you can only do one monitoring task today, alert on root usage and changes to logging. Those are high-signal indicators of compromise or risky behavior.\r\n\r\n<h2 id=\"4-protect-data-by-default-s3-encryption-and-key-management-basics\">4) Protect data by default: S3, encryption, and key management basics</h2>\r\nFor many SMEs, the first “real” AWS asset is storage: S3 buckets for files, backups, exports, or logs. Most public cloud data exposures come from misconfigurations—not sophisticated hacks.\r\n\r\n1) Set S3 Block Public Access at the account level.\r\n<ul>\n<li>Action: Enable it globally unless you have a very explicit business need for public content.</li>\n<li>Example: If marketing needs a public static website, host it via a controlled pattern (e.g., CDN in front) rather than making random buckets public.</li>\n</ul>\n\r\n2) Enable EBS encryption by default.\r\n<ul>\n<li>Action: Turn on “encryption by default” so any new volumes are encrypted automatically.</li>\n<li>Example: A developer launches a test server with customer data; encryption is automatic, even if they forget.</li>\n</ul>\n\r\n3) Decide how you’ll use KMS keys.\r\n<ul>\n<li>Day one approach:</li>\n<li>Use AWS-managed keys where appropriate for simplicity.</li>\n<li>Use customer-managed keys when you need tighter control (e.g., key rotation policies, separation of duties).</li>\n<li>Example: Use a customer-managed key for sensitive databases and restrict who can administer that key.</li>\n</ul>\n\r\n4) Set a default S3 bucket policy pattern.\r\n<ul>\n<li>Action: Require TLS (deny non-HTTPS) and consider requiring encryption headers for uploads.</li>\n<li>Example: Deny requests where <code>aws:SecureTransport</code> is false.</li>\n</ul>\n\r\nPractical tip: Encryption doesn’t replace access control. Treat encryption as a safety net; IAM and bucket policies remain your primary gatekeepers.\r\n\r\n<h2 id=\"5-add-guardrails-for-cost-regions-and-oops-moments\">5) Add guardrails for cost, regions, and “oops” moments</h2>\r\nSecurity incidents aren’t always intrusions—sometimes they’re mistakes that lead to outages or surprise bills.\r\n\r\n1) Set up AWS Budgets and billing alerts.\r\n<ul>\n<li>Action: Create a monthly budget and alerts at thresholds (e.g., 50%, 80%, 100%).</li>\n<li>Example: An exposed access key can be used for crypto-mining or high-cost services. A budget alert can be an early warning.</li>\n</ul>\n\r\n2) Restrict regions (if your business can).\r\n<ul>\n<li>Action: Decide which regions you will use and block others via policy.</li>\n<li>Example: If you operate only in one region, restricting regions reduces the chance of shadow deployments and simplifies monitoring.</li>\n</ul>\n\r\n3) Define a tagging baseline.\r\n<ul>\n<li>Action: Require tags like <code>Owner</code>, <code>Environment</code>, <code>CostCenter</code>, and <code>DataClassification</code>.</li>\n<li>Example: When an alert fires on an S3 bucket, tags tell you who owns it and whether it contains sensitive data.</li>\n</ul>\n\r\n4) Create a break-glass runbook.\r\n<ul>\n<li>Action: Write a simple procedure for suspected compromise: rotate credentials, disable access keys, review CloudTrail, isolate workloads.</li>\n<li>Example: Include who to call, where logs are, and how to temporarily block outbound traffic if needed.</li>\n</ul>\n\r\nPractical tip: Guardrails are operational security. They reduce the time between a problem starting and a human noticing.\r\n\r\n<h2 id=\"checklist\">Checklist</h2>\r\n<ul>\n<li>[ ] Enable MFA on the root user and store recovery info securely</li>\n<li>[ ] Create an admin role for humans; stop using root for daily work</li>\n<li>[ ] Enforce MFA for privileged roles/users (including any “admin” access)</li>\n<li>[ ] Turn on CloudTrail for all regions and write logs to a dedicated S3 bucket</li>\n<li>[ ] Block public S3 access at the account level</li>\n<li>[ ] Enable EBS encryption by default</li>\n<li>[ ] Enable IAM Access Analyzer and review external access findings</li>\n<li>[ ] Set a monthly AWS Budget with multiple alert thresholds</li>\n<li>[ ] Add CloudWatch alarms for root usage and logging/ IAM changes</li>\n<li>[ ] Define required tags (Owner, Environment, DataClassification) and apply them early</li>\n</ul>\n\r\n<h2 id=\"faq\">FAQ</h2>\r\nQ1: Do we need to do all 10 settings before deploying anything?\r\nA: Ideally yes, but if you must prioritize: root MFA, admin role, CloudTrail, S3 block public access, and budgets/alerts.\r\n\r\nQ2: Should we create IAM users for everyone?\r\nA: Prefer roles and centralized identity (SSO/federation) when possible; IAM users can work temporarily but increase management overhead.\r\n\r\nQ3: Is enabling encryption enough to protect our data?\r\nA: No. Encryption helps if storage is exposed or copied, but access control (IAM, bucket policies, security groups) is what prevents exposure in the first place.",
  "translatedContent": {
    "fr": "<h2 id=\"intro\">Introduction</h2>Créer votre premier compte AWS est passionnant, jusqu'à ce que vous réalisiez que la posture par défaut est « prêt à créer » et non « prêt à affronter les attaquants ». Le travail de sécurité dès le premier jour concerne principalement la configuration, pas le code, et il est immédiatement rentable en réduisant le rayon d'erreurs. Pour les PME, l’objectif n’est pas la perfection ; il s'agit de créer des garde-fous de base permettant aux équipes d'avancer rapidement sans laisser de portes évidentes ouvertes. Cet article présente 10 paramètres à vérifier dès le premier jour, avec des exemples pratiques que vous pouvez mettre en œuvre en moins de quelques heures.<h2 id=\"quick-take\">Prise rapide</h2><ul><li>Activez MFA sur l'utilisateur root, puis arrêtez d'utiliser root pour le travail quotidien.</li><li>Créez un rôle d'administrateur pour les humains et utilisez des stratégies IAM de moindre privilège pour tout le reste.</li><li>Activez la journalisation à l'échelle de l'organisation (CloudTrail) et centralisez les journaux le plus tôt possible.</li><li>Ajoutez des garde-fous en termes de coûts et de sécurité (Budgets + alertes ; services de détection de base).</li><li>Appliquez le cryptage et les valeurs par défaut sécurisées (S3 bloque l'accès public, cryptage EBS par défaut).</li></ul><h2 id=\"1-lock-down-identity-root-mfa-and-an-admin-role\">1) Verrouiller l'identité : root, MFA et un rôle d'administrateur</h2>L'« utilisateur racine » de votre compte AWS est l'identité clé du royaume. Traitez-le comme un compte brisé en verre.\r\n\r\n1) Activez le MFA racine (clé matérielle ou application d'authentification).<ul><li>Action : Connectez-vous une fois en tant qu'utilisateur root, configurez MFA et stockez les codes de récupération en toute sécurité.</li><li>Exemple : placez les instructions de bris de vitre dans votre gestionnaire de mots de passe avec un accès restreint (par exemple, deux responsables informatiques).</li></ul>2) Arrêtez d'utiliser root pour les tâches normales.<ul><li>Action : Créez un rôle d'administrateur IAM et utilisez ce rôle pour l'administration.</li><li>Exemple : créez un utilisateur IAM (ou mieux, fédérez-le à partir de votre fournisseur d'identité ultérieurement), accordez-lui l'autorisation d'assumer un rôle « Administrateur », puis appliquez l'authentification multifacteur sur cet utilisateur.</li></ul>3) Utilisez des rôles plutôt que des clés d'accès de longue durée.<ul><li>Pourquoi : fuite des clés d'accès. Les rôles réduisent la prolifération des clés et facilitent la rotation des accès.</li><li>Exemple : si un système CI a besoin d'un accès AWS, attribuez-lui un rôle via des mécanismes natifs AWS (tels que des rôles d'instance/des rôles de tâche) plutôt que de copier les clés dans des variables d'environnement.</li></ul>4) Définissez une politique de mot de passe de compte (si vous utilisez des utilisateurs IAM).<ul><li>Action : Exigez des mots de passe longs et interdisez la réutilisation des mots de passe. Même si vous envisagez de migrer prochainement vers le SSO, une politique de mot de passe vous aidera pendant la transition.</li></ul>Conseil pratique : dans les PME, le plus grand risque d’identité est dès le début que « tout le monde est administrateur pour toujours ». Commencez avec un rôle d'administrateur, puis créez des rôles distincts pour la facturation seule, la lecture seule et le déploiement.<h2 id=\"2-establish-least-privilege-with-iam-baselines-and-guardrails\">2) Établir le moindre privilège avec les lignes de base et les garde-fous IAM</h2>Une fois l’identité contrôlée, les autorisations constituent la deuxième source de risque la plus importante.\r\n\r\n1) Évitez d’utiliser la stratégie par défaut « AdministratorAccess » pour l’ingénierie quotidienne.<ul><li>Action : Créez des modèles d'accès basés sur les rôles : Administrateur, PowerUser/DevOps, ReadOnly, Facturation.</li><li>Exemple : les développeurs peuvent être autorisés à déployer dans des environnements spécifiques (comme « dev ») mais ne peuvent pas modifier les paramètres à l'échelle du compte.</li></ul>2) Utilisez des groupes et des rôles pour que l'accès reste révisable.<ul><li>Action : regroupez les utilisateurs en groupes (si vous utilisez des utilisateurs IAM) ou mappez les groupes SSO aux rôles.</li><li>Exemple : le groupe « Responsables informatiques » peut assumer le rôle d'administrateur ; « Finance » peut assumer le rôle de facturation.</li></ul>3) Ajoutez un modèle de limite d'autorisation de base.<ul><li>Pourquoi : les limites évitent une erreur dans laquelle quelqu'un crée une stratégie qui accorde accidentellement des autorisations trop larges.</li><li>Exemple : appliquez une limite qui bloque les actions à risque telles que la désactivation de CloudTrail, la modification des services de sécurité clés ou la publication de compartiments S3 (même si vous l'ajustez ultérieurement).</li></ul>4) Activez IAM Access Analyzer.<ul><li>Ce qu'il fait : met en évidence les ressources accessibles depuis l'extérieur de votre compte (par exemple, les compartiments S3, les clés KMS, les rôles IAM avec confiance externe).</li><li>Exemple : Si vous voyez une stratégie de compartiment S3 autorisant « Principal : * » ou un accès large entre comptes, corrigez-la avant qu'elle ne devienne un incident d'exposition de données.</li></ul>Conseil pratique : Le moindre privilège est un voyage. Votre objectif dès le premier jour est d’éviter une surexposition évidente et de rendre les autorisations vérifiables. Vous pouvez renforcer les politiques à mesure que vous découvrez ce dont les charges de travail ont réellement besoin.<h2 id=\"3-turn-on-logging-and-monitoring-before-you-deploy-workloads\">3) Activez la journalisation et la surveillance avant de déployer des charges de travail</h2>Lorsque quelque chose ne va pas, les journaux font la différence entre « nous pensons… » et « nous savons ». Activez-les maintenant, avant la mise en ligne de la première instance, base de données ou compartiment.\r\n\r\n1) Activez AWS CloudTrail dans toutes les régions.<ul><li>Action : Créez un journal au niveau de l'organisation/du compte qui enregistre les événements de gestion et écrit dans un compartiment S3 dédié.</li><li>Exemple : si quelqu'un modifie un groupe de sécurité pour autoriser 0.0.0.0/0 sur le port 22, CloudTrail peut montrer qui l'a fait et quand.</li></ul>2) Sécurisez le seau à journaux.<ul><li>Action : Bloquez l'accès public, limitez les autorisations d'écriture au service de journalisation et envisagez de créer un compte « journaux » distinct plus tard.</li><li>Exemple : utilisez des stratégies de compartiment S3 qui autorisent uniquement CloudTrail à écrire et vos administrateurs de sécurité à lire.</li></ul>3) Activez les alarmes CloudWatch pour les signaux évidents.<ul><li>Exemples :</li><li>Alarme sur l'utilisation du compte root.</li><li>Alarme sur les changements de politique IAM.</li><li>Alarme sur CloudTrail arrêtée ou modifiée.</li></ul>4) Activez au moins un service de détection de base.<ul><li>Les options incluent des services de détection des menaces et de surveillance de la configuration natifs AWS.</li><li>Objectif : obtenir des résultats exploitables, pas du bruit. Commencez par les valeurs par défaut, puis réglez.</li></ul>Conseil pratique : si vous ne pouvez effectuer qu'une seule tâche de surveillance aujourd'hui, alertez sur l'utilisation de root et les modifications apportées à la journalisation. Ce sont des indicateurs élevés de compromission ou de comportement à risque.<h2 id=\"4-protect-data-by-default-s3-encryption-and-key-management-basics\">4) Protéger les données par défaut : bases de S3, de chiffrement et de gestion des clés</h2>Pour de nombreuses PME, le premier « véritable » actif AWS est le stockage : des compartiments S3 pour les fichiers, les sauvegardes, les exportations ou les journaux. La plupart des expositions aux données du cloud public proviennent de mauvaises configurations et non de piratages sophistiqués.\r\n\r\n1) Définissez S3 Block Public Access au niveau du compte.<ul><li>Action : activez-le à l'échelle mondiale, sauf si vous avez un besoin commercial très explicite de contenu public.</li><li>Exemple : si le marketing a besoin d'un site Web statique public, hébergez-le via un modèle contrôlé (par exemple, CDN devant) plutôt que de rendre publics des compartiments aléatoires.</li></ul>2) Activez le cryptage EBS par défaut.<ul><li>Action : activez le « chiffrement par défaut » afin que tous les nouveaux volumes soient automatiquement chiffrés.</li><li>Exemple : un développeur lance un serveur de test avec des données client ; le cryptage est automatique, même s’ils oublient.</li></ul>3) Décidez comment vous utiliserez les clés KMS.<ul><li>Approche du premier jour :</li><li>Utilisez les clés gérées par AWS lorsque cela est approprié pour plus de simplicité.</li><li>Utilisez des clés gérées par le client lorsque vous avez besoin d'un contrôle plus strict (par exemple, politiques de rotation des clés, séparation des tâches).</li><li>Exemple : utilisez une clé gérée par le client pour les bases de données sensibles et limitez les personnes pouvant administrer cette clé.</li></ul>4) Définissez un modèle de stratégie de compartiment S3 par défaut.<ul><li>Action : Exigez TLS (refuser les non-HTTPS) et envisagez d'exiger des en-têtes de chiffrement pour les téléchargements.</li><li>Exemple : Refuser les demandes où<code>aws:SecureTransport</code>est faux.</li></ul>Conseil pratique : le cryptage ne remplace pas le contrôle d’accès. Considérez le cryptage comme un filet de sécurité ; Les politiques IAM et de compartiment restent vos principaux gardiens.<h2 id=\"5-add-guardrails-for-cost-regions-and-oops-moments\">5) Ajoutez des garde-fous pour les coûts, les régions et les moments « oups »</h2>Les incidents de sécurité ne sont pas toujours des intrusions : il s’agit parfois d’erreurs qui entraînent des pannes ou des factures surprises.\r\n\r\n1) Configurez les budgets AWS et les alertes de facturation.<ul><li>Action : Créez un budget mensuel et des alertes selon des seuils (par exemple, 50 %, 80 %, 100 %).</li><li>Exemple : Une clé d'accès exposée peut être utilisée pour du crypto-minage ou des services coûteux. Une alerte budgétaire peut être un avertissement précoce.</li></ul>2) Restreindre les régions (si votre entreprise le peut).<ul><li>Action : décidez quelles régions vous utiliserez et bloquez les autres via une politique.</li><li>Exemple : si vous opérez uniquement dans une seule région, la restriction des régions réduit le risque de déploiements fantômes et simplifie la surveillance.</li></ul>3) Définissez une ligne de base de balisage.<ul><li>Action : Exiger des balises telles que<code>Propriétaire</code>,<code>Environnement</code>,<code>Centre de coûts</code>, et<code>Classification des données</code>.</li><li>Exemple : lorsqu'une alerte se déclenche sur un compartiment S3, les balises vous indiquent à qui il appartient et s'il contient des données sensibles.</li></ul>4) Créez un runbook bris de verre.<ul><li>Action : rédigez une procédure simple en cas de suspicion de compromission : alternez les informations d'identification, désactivez les clés d'accès, examinez CloudTrail, isolez les charges de travail.</li><li>Exemple : indiquez qui appeler, où se trouvent les journaux et comment bloquer temporairement le trafic sortant si nécessaire.</li></ul>Conseil pratique : les garde-corps sont une sécurité opérationnelle. Ils réduisent le temps entre le début d’un problème et la détection humaine.<h2 id=\"checklist\">Liste de contrôle</h2><ul><li>[ ] Activez MFA sur l'utilisateur root et stockez les informations de récupération en toute sécurité</li><li>[ ] Créez un rôle d'administrateur pour les humains ; arrêtez d'utiliser root pour le travail quotidien</li><li>[ ] Appliquer MFA pour les rôles/utilisateurs privilégiés (y compris tout accès « administrateur »)</li><li>[ ] Activez CloudTrail pour toutes les régions et écrivez les journaux dans un compartiment S3 dédié</li><li>[ ] Bloquer l'accès public à S3 au niveau du compte</li><li>[ ] Activer le cryptage EBS par défaut</li><li>[ ] Activer IAM Access Analyzer et examiner les résultats d'accès externe</li><li>[ ] Définir un budget AWS mensuel avec plusieurs seuils d'alerte</li><li>[ ] Ajoutez des alarmes CloudWatch pour l'utilisation root et la journalisation/les modifications IAM</li><li>[ ] Définir les balises requises (Propriétaire, Environnement, DataClassification) et les appliquer tôt</li></ul><h2 id=\"faq\">FAQ</h2>Q1 : Devons-nous effectuer les 10 paramètres avant de déployer quoi que ce soit ?\r\nR : Idéalement oui, mais si vous devez prioriser : MFA racine, rôle d'administrateur, CloudTrail, accès public bloqué par S3 et budgets/alertes.\r\n\r\nQ2 : Devrions-nous créer des utilisateurs IAM pour tout le monde ?\r\nR : Privilégiez les rôles et l'identité centralisée (SSO/fédération) lorsque cela est possible ; Les utilisateurs IAM peuvent travailler temporairement mais augmentent les frais de gestion.\r\n\r\nQ3 : Activer le chiffrement est-il suffisant pour protéger nos données ?\r\nR : Non. Le chiffrement est utile si le stockage est exposé ou copié, mais le contrôle d'accès (IAM, stratégies de compartiment, groupes de sécurité) est ce qui empêche l'exposition en premier lieu."
  }
}