{
  "slug": "soc-playbook-triage-escalate-sme-alerts",
  "metadata": {
    "title": "SOC Playbook: Triage and Escalate SME Security Alerts",
    "description": "Reduce alert fatigue and improve incident response with a lightweight SOC triage playbook tailored for small security teams.",
    "date": "2026-01-19",
    "pillar": "SOC",
    "tags": [
      "SME",
      "Security"
    ]
  },
  "translatedMetadata": {
    "fr": {
      "title": "Playbook SOC : Trier et transmettre les alertes de sécurité des PME",
      "description": "Réduisez la fatigue liée aux alertes et améliorez la réponse aux incidents grâce à un manuel de triage SOC léger conçu pour les petites équipes de sécurité.",
      "date": "2026-01-19",
      "pillar": "SOC",
      "tags": [
        "PME",
        "Sécurité"
      ]
    }
  },
  "content": "<h2 id=\"intro\">Intro</h2>\r\nSmall and mid-sized businesses often get the same handful of security alerts, but the difference between “noise” and “incident” comes down to process. A lightweight SOC playbook helps you make consistent decisions under time pressure, even if your team is small or part-time. This post gives you practical triage steps, evidence to collect, and clear escalation triggers for common SME alerts. Use it to reduce panic, cut alert fatigue, and preserve the data you’ll need if something is truly wrong.\r\n\r\n<h2 id=\"quick-take\">Quick take</h2>\r\n<ul>\n<li>Triage is a repeatable decision process: confirm, scope, contain, and document before you “fix.”</li>\n<li>Always capture minimum evidence first (timestamps, affected assets, identities, and relevant logs).</li>\n<li>Use severity levels tied to business impact and confidence, not just the tool’s “critical” label.</li>\n<li>Define escalation triggers in advance (e.g., privileged accounts, ransomware indicators, widespread impact).</li>\n<li>Close the loop: label outcomes, tune detections, and update playbooks after every meaningful case.</li>\n</ul>\n\r\n<h2 id=\"1-triage-workflow-confirm-scope-contain-decide\">1) Triage workflow: confirm → scope → contain → decide</h2>\r\nA practical SME-friendly triage loop can be summarized in four phases. Keep it simple enough that any on-call engineer can follow it.\r\n\r\n<h3 id=\"step-a-confirm-the-alert-is-real-and-not-misfired\">Step A: Confirm the alert is real (and not misfired)</h3>\r\nGoal: decide whether the alert corresponds to an actual event on your systems.\r\n\r\nActions:\r\n<ul>\n<li>Identify the source: endpoint agent, email gateway, firewall, cloud audit logs, identity provider, etc.</li>\n<li>Validate key fields: affected host/user, time window, detection reason, and raw event IDs if available.</li>\n<li>Check for obvious false positives: known scanner IPs, scheduled admin scripts, patching activity, vulnerability scans, or legitimate travel.</li>\n</ul>\n\r\nExample: A “suspicious PowerShell” alert may be legitimate if it matches your known software deployment job. Confirm by comparing the parent process, script path, and the signed publisher (if applicable).\r\n\r\n<h3 id=\"step-b-scope-the-blast-radius\">Step B: Scope the blast radius</h3>\r\nGoal: understand “how big” before you take actions that erase evidence.\r\n\r\nActions:\r\n<ul>\n<li>Determine whether it’s one user/host or multiple.</li>\n<li>Identify related events in the same timeframe: authentication logs, process execution, outbound connections, mailbox rules, file modifications.</li>\n<li>Look for lateral movement indicators: new admin group membership, remote service creation, repeated failed logons, unusual SMB/RDP activity.</li>\n</ul>\n\r\nExample: If a user clicked a phishing link, scope includes: the user’s mailbox activity, sign-in logs for that account, and any downloads/executions on their endpoint.\r\n\r\n<h3 id=\"step-c-contain-safely-dont-destroy-evidence\">Step C: Contain safely (don’t destroy evidence)</h3>\r\nGoal: stop ongoing harm while preserving what you may need for response.\r\n\r\nActions (choose the least disruptive option that works):\r\n<ul>\n<li>Disable or reset credentials if compromise is likely.</li>\n<li>Isolate a host from the network rather than powering it off.</li>\n<li>Block a domain/IP only after verifying it’s not business-critical.</li>\n<li>Quarantine emails and remove similar messages from inboxes.</li>\n</ul>\n\r\nRule of thumb: if you might need forensics later, avoid “cleanup first.” Preserve logs, disk images, and relevant cloud audit trails if feasible.\r\n\r\n<h3 id=\"step-d-decide-close-monitor-or-escalate\">Step D: Decide: close, monitor, or escalate</h3>\r\nYour outcome should land in one of these buckets:\r\n<ul>\n<li>Close as false positive (with a note explaining why).</li>\n<li>Close as benign/expected (document the change and consider tuning).</li>\n<li>Monitor (insufficient confidence; set a time-bound follow-up).</li>\n<li>Escalate to incident response (meets severity or trigger criteria).</li>\n</ul>\n\r\n<h2 id=\"2-severity-and-escalation-model-built-for-smes\">2) Severity and escalation model built for SMEs</h2>\r\nMany SMEs struggle because every “high” alert feels like a crisis. Instead, use a severity model based on two dimensions: impact and confidence.\r\n\r\n<h3 id=\"suggested-severity-levels\">Suggested severity levels</h3>\r\n<ul>\n<li>Severity 1 (Informational): No evidence of compromise; policy or hygiene issue.</li>\n<li>Severity 2 (Low): Suspicious but limited scope; no confirmed compromise.</li>\n<li>Severity 3 (Medium): Probable compromise or policy breach with limited impact.</li>\n<li>Severity 4 (High): Confirmed compromise affecting sensitive systems/data or business-critical operations.</li>\n<li>Severity 5 (Critical): Active ransomware/extortion, widespread compromise, or safety/legal impact.</li>\n</ul>\n\r\n<h3 id=\"escalation-triggers-decide-these-in-advance\">Escalation triggers (decide these in advance)</h3>\r\nEscalate immediately (or page on-call) if any of the following are true:\r\n<ul>\n<li>Privileged identity involved (admin, finance approver, domain admin, cloud admin).</li>\n<li>Evidence of credential theft or MFA bypass (impossible travel plus token reuse, multiple MFA push prompts, new device enrollment you can’t explain).</li>\n<li>Indicators of ransomware activity (rapid mass file changes, shadow copy deletion attempts, suspicious encryption processes).</li>\n<li>Data access looks abnormal (large exports, new sharing permissions, downloads from sensitive repositories).</li>\n<li>Multiple systems show related behavior in a short window (suggests worm/lateral movement).</li>\n</ul>\n\r\n<h3 id=\"who-gets-escalated-to-whom\">Who gets escalated to whom</h3>\r\nDefine a simple chain:\r\n<ul>\n<li>Tier 1/on-call: initial triage and evidence capture.</li>\n<li>Tier 2/IR lead (internal or MSP/MSSP): containment strategy, deeper investigation.</li>\n<li>Business owner/operations lead: when downtime, financial risk, or customer impact is likely.</li>\n<li>Legal/privacy contact: when regulated data exposure is plausible.</li>\n</ul>\n\r\nThe point isn’t “compliance”; it’s fast decision-making under stress.\r\n\r\n<h2 id=\"3-common-sme-alerts-and-what-to-do-with-examples\">3) Common SME alerts and what to do (with examples)</h2>\r\nBelow are frequently seen alerts and practical triage steps. Treat these as templates and adapt to your environment.\r\n\r\n<h3 id=\"a-suspicious-sign-in-new-location-impossible-travel-atypical-device\">A) Suspicious sign-in (new location, impossible travel, atypical device)</h3>\r\nTriage:\r\n<ul>\n<li>Check identity logs: source IP, geo, device identifier, user agent, MFA method used, and whether the sign-in succeeded.</li>\n<li>Look for follow-on actions: mailbox rule creation, forwarding changes, token grants, unusual file downloads.</li>\n</ul>\n\r\nContainment:\r\n<ul>\n<li>If confidence is medium/high: reset password, revoke sessions/tokens, require MFA re-registration if needed.</li>\n<li>If user insists it was them: still verify by matching device and IP to known travel/VPN.</li>\n</ul>\n\r\nEscalate if:\r\n<ul>\n<li>Admin account.</li>\n<li>MFA fatigue behavior (repeated prompts) or new MFA method enrollment.</li>\n</ul>\n\r\nExample decision:\r\n<ul>\n<li>If sign-in succeeded and was followed by new inbox rules: escalate (probable account takeover).</li>\n</ul>\n\r\n<h3 id=\"b-malwareedr-detection-on-a-workstation\">B) Malware/EDR detection on a workstation</h3>\r\nTriage:\r\n<ul>\n<li>Identify detection type: blocked/quarantined vs allowed.</li>\n<li>Pull basics: process tree (parent/child), file path, hash (if available), network connections, user context.</li>\n<li>Confirm if it came from email attachment, web download, or removable media.</li>\n</ul>\n\r\nContainment:\r\n<ul>\n<li>Isolate host if execution occurred or network callbacks are present.</li>\n<li>Preserve the suspicious file and relevant logs.</li>\n</ul>\n\r\nEscalate if:\r\n<ul>\n<li>Malware executed (not just downloaded).</li>\n<li>Credential access tools suspected.</li>\n<li>Multiple endpoints show similar detections.</li>\n</ul>\n\r\nExample decision:\r\n<ul>\n<li>A quarantined adware installer with no execution may be low; a suspicious script that ran under a user profile and contacted external IPs is medium/high.</li>\n</ul>\n\r\n<h3 id=\"c-phishing-report-or-malicious-link-clicked\">C) Phishing report or malicious link clicked</h3>\r\nTriage:\r\n<ul>\n<li>Retrieve the email headers and message content.</li>\n<li>Determine if the user clicked, entered credentials, or downloaded a file.</li>\n<li>Search for similar emails delivered to other users.</li>\n</ul>\n\r\nContainment:\r\n<ul>\n<li>Quarantine/remove the email across mailboxes.</li>\n<li>If credentials entered: reset password, revoke sessions, review sign-ins, and enforce MFA if not already.</li>\n</ul>\n\r\nEscalate if:\r\n<ul>\n<li>Finance or payroll user.</li>\n<li>External forwarding rules appear.</li>\n<li>New OAuth app consent or token grants occur unexpectedly.</li>\n</ul>\n\r\nExample decision:\r\n<ul>\n<li>“User clicked but did not enter credentials” may be monitor + endpoint scan; “entered credentials” is immediate escalation.</li>\n</ul>\n\r\n<h3 id=\"d-firewall-alert-outbound-connection-to-suspicious-domainip\">D) Firewall alert: outbound connection to suspicious domain/IP</h3>\r\nTriage:\r\n<ul>\n<li>Identify the internal host and process generating the traffic.</li>\n<li>Check frequency and volume: one-off DNS lookup vs repeated beaconing.</li>\n<li>Verify whether the destination is part of a legitimate service your business uses.</li>\n</ul>\n\r\nContainment:\r\n<ul>\n<li>Block the destination if safe.</li>\n<li>Investigate the host for suspicious processes and persistence.</li>\n</ul>\n\r\nEscalate if:\r\n<ul>\n<li>Beaconing pattern (regular intervals).</li>\n<li>Data exfil indicators (large outbound transfers to uncommon destinations).</li>\n</ul>\n\r\nExample decision:\r\n<ul>\n<li>A single blocked connection might be informational; repeated successful connections plus unknown process is medium/high.</li>\n</ul>\n\r\n<h2 id=\"4-evidence-pack-what-to-capture-every-time\">4) Evidence pack: what to capture every time</h2>\r\nWhen escalation happens, teams often lose time re-collecting basics. Build a “minimum evidence pack” that Tier 1 captures before changes.\r\n\r\nCapture these items:\r\n<ul>\n<li>Timeline: first seen, last seen, and key event timestamps (with time zone).</li>\n<li>Entities: user(s), host(s), IPs, domains, mailbox IDs, cloud resource IDs.</li>\n<li>Raw logs: authentication events, email trace, endpoint detection details, firewall/proxy logs.</li>\n<li>Screenshots or exports (where appropriate) of alert details.</li>\n<li>Actions taken: password reset, host isolation, blocks added, emails removed.</li>\n<li>Current status: contained/not contained; ongoing suspicious activity yes/no.</li>\n</ul>\n\r\nPractical tip: store evidence in a restricted-access incident folder with consistent naming (e.g., <code>INC-YYYYMMDD-###-short-desc</code>).\r\n\r\n<h2 id=\"checklist\">Checklist</h2>\r\n<ul>\n<li>[ ] Confirm alert source, affected asset(s), and time window</li>\n<li>[ ] Verify whether the alert indicates successful action (login succeeded, file executed, connection allowed)</li>\n<li>[ ] Identify impacted user(s), device(s), and any privileged accounts involved</li>\n<li>[ ] Collect minimum evidence pack (timeline, entities, raw logs, alert details)</li>\n<li>[ ] Scope related events in the surrounding timeframe (±24 hours if feasible)</li>\n<li>[ ] Check for lateral movement or persistence indicators</li>\n<li>[ ] Apply least-disruptive containment (isolate host, revoke sessions, quarantine email)</li>\n<li>[ ] Assign severity based on impact and confidence (not tool label)</li>\n<li>[ ] Escalate if triggers are met (privileged, ransomware indicators, multi-system spread)</li>\n<li>[ ] Document outcome and tuning opportunities (false positive reason, detection improvements)</li>\n</ul>\n\r\n<h2 id=\"faq\">FAQ</h2>\r\nQ1: Should we always isolate a machine when EDR flags malware?\r\nA: Not always—if it was blocked/quarantined with no execution evidence, you may monitor; if execution or callbacks occurred, isolate and escalate.\r\n\r\nQ2: How do we handle “impossible travel” alerts for remote staff using VPNs?\r\nA: Validate the sign-in with device ID/user agent and known VPN egress IPs; treat successful sign-ins with follow-on suspicious actions as escalation-worthy.\r\n\r\nQ3: What’s the single biggest mistake in SME triage?\r\nA: Fixing first and investigating later—contain and preserve evidence before cleanup so you can confirm scope and prevent recurrence.",
  "translatedContent": {
    "fr": "<h2 id=\"intro\">Introduction</h2>Les petites et moyennes entreprises reçoivent souvent le même nombre d'alertes de sécurité, mais la différence entre « bruit » et « incident » réside dans le processus. Un playbook SOC léger vous aide à prendre des décisions cohérentes sous pression de temps, même si votre équipe est petite ou à temps partiel. Cet article vous présente des étapes de tri pratiques, des preuves à collecter et des déclencheurs clairs pour les alertes PME courantes. Utilisez-le pour réduire la panique, réduire la fatigue des alertes et préserver les données dont vous aurez besoin si quelque chose ne va vraiment pas.<h2 id=\"quick-take\">Prise rapide</h2><ul><li>Le triage est un processus de décision reproductible : confirmer, définir la portée, contenir et documenter avant de « corriger ».</li><li>Commencez toujours par capturer un minimum de preuves (horodatages, actifs concernés, identités et journaux pertinents).</li><li>Utilisez des niveaux de gravité liés à l’impact commercial et à la confiance, et pas seulement à l’étiquette « critique » de l’outil.</li><li>Définissez à l'avance les déclencheurs de remontée d'informations (par exemple, comptes privilégiés, indicateurs de rançongiciel, impact généralisé).</li><li>Bouclez la boucle : étiquetez les résultats, ajustez les détections et mettez à jour les playbooks après chaque cas significatif.</li></ul><h2 id=\"1-triage-workflow-confirm-scope-contain-decide\">1) Workflow de tri : confirmer → portée → contenir → décider</h2>Une boucle de triage pratique et adaptée aux PME peut être résumée en quatre phases. Gardez les choses suffisamment simples pour que tout ingénieur de garde puisse le suivre.<h3 id=\"step-a-confirm-the-alert-is-real-and-not-misfired\">Étape A : Confirmez que l'alerte est réelle (et qu'elle n'a pas échoué)</h3>Objectif : décider si l'alerte correspond à un événement réel sur vos systèmes.\r\n\r\nActes:<ul><li>Identifiez la source : agent de point de terminaison, passerelle de messagerie, pare-feu, journaux d'audit cloud, fournisseur d'identité, etc.</li><li>Validez les champs clés : hôte/utilisateur concerné, fenêtre horaire, motif de détection et ID d'événement bruts si disponibles.</li><li>Recherchez les faux positifs évidents : adresses IP de scanner connues, scripts d'administration planifiés, activités de correctifs, analyses de vulnérabilités ou voyages légitimes.</li></ul>Exemple : une alerte « PowerShell suspect » peut être légitime si elle correspond à votre tâche de déploiement de logiciel connue. Confirmez en comparant le processus parent, le chemin du script et l'éditeur signé (le cas échéant).<h3 id=\"step-b-scope-the-blast-radius\">Étape B : Déterminer le rayon de l'explosion</h3>Objectif : comprendre « quelle ampleur » avant de prendre des mesures qui effacent les preuves.\r\n\r\nActes:<ul><li>Déterminez s’il s’agit d’un utilisateur/hôte ou de plusieurs.</li><li>Identifiez les événements associés dans la même période : journaux d'authentification, exécution de processus, connexions sortantes, règles de boîte aux lettres, modifications de fichiers.</li><li>Recherchez les indicateurs de mouvement latéral : nouvelle adhésion à un groupe d'administrateurs, création de services à distance, échecs de connexion répétés, activité SMB/RDP inhabituelle.</li></ul>Exemple : si un utilisateur a cliqué sur un lien de hameçonnage, la portée inclut : l'activité de la boîte aux lettres de l'utilisateur, les journaux de connexion pour ce compte et tous les téléchargements/exécutions sur leur point de terminaison.<h3 id=\"step-c-contain-safely-dont-destroy-evidence\">Étape C : Contenir en toute sécurité (ne pas détruire les preuves)</h3>Objectif : mettre fin aux dommages en cours tout en préservant ce dont vous pourriez avoir besoin pour répondre.\r\n\r\nActions (choisissez l'option la moins perturbatrice qui fonctionne) :<ul><li>Désactivez ou réinitialisez les informations d’identification si une compromission est probable.</li><li>Isolez un hôte du réseau plutôt que de le mettre hors tension.</li><li>Bloquez un domaine/une adresse IP uniquement après avoir vérifié qu'il n'est pas critique pour l'entreprise.</li><li>Mettez les e-mails en quarantaine et supprimez les messages similaires des boîtes de réception.</li></ul>Règle générale : si vous pourriez avoir besoin d’expertises médico-légales plus tard, évitez le « nettoyage d’abord ». Conservez les journaux, les images disque et les pistes d’audit cloud pertinentes si possible.<h3 id=\"step-d-decide-close-monitor-or-escalate\">Étape D : Décidez : fermer, surveiller ou faire remonter</h3>Votre résultat devrait atterrir dans l’un de ces compartiments :<ul><li>Fermer comme faux positif (avec une note expliquant pourquoi).</li><li>Fermer comme inoffensif/attendu (documenter le changement et envisager le réglage).</li><li>Surveiller (confiance insuffisante ; fixer un suivi limité dans le temps).</li><li>Passer à la réponse à l'incident (répond aux critères de gravité ou de déclenchement).</li></ul><h2 id=\"2-severity-and-escalation-model-built-for-smes\">2) Modèle de gravité et d'escalade conçu pour les PME</h2>De nombreuses PME sont en difficulté parce que chaque alerte « haute » ressemble à une crise. Utilisez plutôt un modèle de gravité basé sur deux dimensions : l’impact et la confiance.<h3 id=\"suggested-severity-levels\">Niveaux de gravité suggérés</h3><ul><li>Gravité 1 (informative) : aucune preuve de compromission ; problème de politique ou d’hygiène.</li><li>Gravité 2 (Faible) : Suspect mais portée limitée ; aucun compromis confirmé.</li><li>Gravité 3 (moyenne) : compromission probable ou violation de la politique avec un impact limité.</li><li>Gravité 4 (élevée) : compromission confirmée affectant les systèmes/données sensibles ou les opérations critiques pour l'entreprise.</li><li>Gravité 5 (Critique) : rançongiciel/extorsion actif, compromission généralisée ou impact sur la sécurité/juridique.</li></ul><h3 id=\"escalation-triggers-decide-these-in-advance\">Déclencheurs d’escalade (décidez-les à l’avance)</h3>Faites remonter immédiatement (ou appelez sur appel) si l'un des éléments suivants est vrai :<ul><li>Identité privilégiée impliquée (administrateur, approbateur financier, administrateur de domaine, administrateur cloud).</li><li>Preuve de vol d’identifiants ou de contournement MFA (déplacement impossible et réutilisation des jetons, plusieurs invites push MFA, inscription d’un nouvel appareil que vous ne pouvez pas expliquer).</li><li>Indicateurs d’activité de rançongiciel (modifications massives rapides de fichiers, tentatives de suppression de clichés instantanés, processus de cryptage suspects).</li><li>L'accès aux données semble anormal (exportations volumineuses, nouvelles autorisations de partage, téléchargements à partir de référentiels sensibles).</li><li>Plusieurs systèmes affichent un comportement associé dans une courte fenêtre (suggère un mouvement de vis sans fin/latéral).</li></ul><h3 id=\"who-gets-escalated-to-whom\">Qui est transmis à qui</h3>Définir une chaîne simple :<ul><li>Niveau 1/sur appel : triage initial et saisie des preuves.</li><li>Responsable de niveau 2/IR (interne ou MSP/MSSP) : stratégie de confinement, enquête plus approfondie.</li><li>Propriétaire de l'entreprise/responsable des opérations : lorsque des temps d'arrêt, des risques financiers ou un impact sur les clients sont probables.</li><li>Contact juridique/confidentialité : lorsque l’exposition réglementée des données est plausible.</li></ul>Il ne s’agit pas de « conformité » ; c’est une prise de décision rapide sous stress.<h2 id=\"3-common-sme-alerts-and-what-to-do-with-examples\">3) Alertes PME courantes et que faire (avec exemples)</h2>Vous trouverez ci-dessous les alertes fréquemment vues et les étapes pratiques de tri. Traitez-les comme des modèles et adaptez-les à votre environnement.<h3 id=\"a-suspicious-sign-in-new-location-impossible-travel-atypical-device\">A) Connexion suspecte (nouvelle localisation, déplacement impossible, appareil atypique)</h3>Triage:<ul><li>Vérifiez les journaux d'identité : IP source, géolocalisation, identifiant de l'appareil, agent utilisateur, méthode MFA utilisée et si la connexion a réussi.</li><li>Recherchez les actions de suivi : création de règles de boîte aux lettres, modifications de transfert, octroi de jetons, téléchargements de fichiers inhabituels.</li></ul>Endiguement:<ul><li>Si la confiance est moyenne/élevée : réinitialisez le mot de passe, révoquez les sessions/jetons, exigez le réenregistrement MFA si nécessaire.</li><li>Si l'utilisateur insiste sur le fait que c'était lui : vérifiez toujours en faisant correspondre l'appareil et l'adresse IP au voyage/VPN connu.</li></ul>Escalader si :<ul><li>Compte administrateur.</li><li>Comportement de fatigue MFA (invites répétées) ou inscription à une nouvelle méthode MFA.</li></ul>Exemple de décision :<ul><li>Si la connexion a réussi et a été suivie par de nouvelles règles de boîte de réception : escalader (prise de contrôle probable du compte).</li></ul><h3 id=\"b-malwareedr-detection-on-a-workstation\">B) Détection de malveillance/EDR sur un poste de travail</h3>Triage:<ul><li>Identifiez le type de détection : bloqué/mis en quarantaine ou autorisé.</li><li>Principes de base du Pull : arborescence des processus (parent/enfant), chemin du fichier, hachage (si disponible), connexions réseau, contexte utilisateur.</li><li>Confirmez s'il provient d'une pièce jointe à un e-mail, d'un téléchargement Web ou d'un support amovible.</li></ul>Endiguement:<ul><li>Isolez l’hôte si une exécution a eu lieu ou si des rappels réseau sont présents.</li><li>Conservez le fichier suspect et les journaux pertinents.</li></ul>Escalader si :<ul><li>Logiciel malveillant exécuté (pas seulement téléchargé).</li><li>Outils d'accès aux informations d'identification suspectés.</li><li>Plusieurs points de terminaison affichent des détections similaires.</li></ul>Exemple de décision :<ul><li>Un installateur de logiciel publicitaire mis en quarantaine sans exécution peut être faible ; un script suspect exécuté sous un profil utilisateur et contactant des adresses IP externes est moyen/élevé.</li></ul><h3 id=\"c-phishing-report-or-malicious-link-clicked\">C) Rapport de hameçonnage ou lien malveillant cliqué</h3>Triage:<ul><li>Récupérez les en-têtes des e-mails et le contenu des messages.</li><li>Déterminez si l'utilisateur a cliqué, saisi ses informations d'identification ou téléchargé un fichier.</li><li>Recherchez des e-mails similaires envoyés à d’autres utilisateurs.</li></ul>Endiguement:<ul><li>Mettez en quarantaine/supprimez l’e-mail dans les boîtes aux lettres.</li><li>Si les informations d'identification sont saisies : réinitialisez le mot de passe, révoquez les sessions, vérifiez les connexions et appliquez l'authentification multifacteur si ce n'est déjà fait.</li></ul>Escalader si :<ul><li>Utilisateur de la finance ou de la paie.</li><li>Les règles de transfert externes apparaissent.</li><li>Le nouveau consentement de l'application OAuth ou l'octroi de jetons se produisent de manière inattendue.</li></ul>Exemple de décision :<ul><li>« L'utilisateur a cliqué mais n'a pas saisi ses informations d'identification » peut être un moniteur + une analyse des points de terminaison ; Les « informations d’identification saisies » constituent une escalade immédiate.</li></ul><h3 id=\"d-firewall-alert-outbound-connection-to-suspicious-domainip\">D) Alerte pare-feu : connexion sortante vers un domaine/une adresse IP suspecte</h3>Triage:<ul><li>Identifiez l’hôte interne et le processus générant le trafic.</li><li>Vérifiez la fréquence et le volume : recherche DNS ponctuelle ou balisage répété.</li><li>Vérifiez si la destination fait partie d'un service légitime utilisé par votre entreprise.</li></ul>Endiguement:<ul><li>Bloquez la destination si elle est sûre.</li><li>Recherchez sur l'hôte les processus suspects et la persistance.</li></ul>Escalader si :<ul><li>Modèle de balisage (intervalles réguliers).</li><li>Indicateurs d'exfil de données (transferts sortants importants vers des destinations inhabituelles).</li></ul>Exemple de décision :<ul><li>Une seule connexion bloquée peut être informative ; les connexions réussies répétées et le processus inconnu sont moyens/élevés.</li></ul><h2 id=\"4-evidence-pack-what-to-capture-every-time\">4) Pack de preuves : ce qu'il faut capturer à chaque fois</h2>Lorsqu’une escalade se produit, les équipes perdent souvent du temps à repenser les bases. Créez un « ensemble de preuves minimum » que le niveau 1 capture avant les modifications.\r\n\r\nCapturez ces éléments :<ul><li>Chronologie : première vue, dernière vue et horodatage des événements clés (avec fuseau horaire).</li><li>Entités : utilisateur(s), hôte(s), adresses IP, domaines, identifiants de boîte aux lettres, identifiants de ressources cloud.</li><li>Journaux bruts : événements d'authentification, trace des e-mails, détails de détection des points de terminaison, journaux de pare-feu/proxy.</li><li>Captures d'écran ou exportations (le cas échéant) des détails de l'alerte.</li><li>Actions entreprises : réinitialisation du mot de passe, isolation de l'hôte, blocs ajoutés, e-mails supprimés.</li><li>Statut actuel : contenu/non contenu ; activité suspecte en cours oui/non.</li></ul>Conseil pratique : stockez les preuves dans un dossier d'incident à accès restreint avec une dénomination cohérente (par exemple,<code>INC-AAAAMMJJ-###-short-desc</code>).<h2 id=\"checklist\">Liste de contrôle</h2><ul><li>[ ] Confirmer la source de l'alerte, les actifs concernés et la fenêtre horaire</li><li>[ ] Vérifiez si l'alerte indique une action réussie (connexion réussie, fichier exécuté, connexion autorisée)</li><li>[ ] Identifiez les utilisateurs, les appareils et tous les comptes privilégiés concernés.</li><li>[ ] Collectez un minimum de preuves (chronologie, entités, journaux bruts, détails de l'alerte)</li><li>[ ] Événements liés à la portée dans la période environnante (± 24 heures si possible)</li><li>[ ] Vérifier les indicateurs de mouvement latéral ou de persistance</li><li>[ ] Appliquer le confinement le moins perturbateur (isoler l'hôte, révoquer les sessions, mettre en quarantaine les e-mails)</li><li>[ ] Attribuer la gravité en fonction de l'impact et de la confiance (et non de l'étiquette de l'outil)</li><li>[ ] Escalader si les déclencheurs sont rencontrés (privilégiés, indicateurs de rançongiciel, propagation multi-systèmes)</li><li>[ ] Documenter les résultats et les opportunités de réglage (faux positifs, améliorations de la détection)</li></ul><h2 id=\"faq\">FAQ</h2>Q1 : Devrions-nous toujours isoler une machine lorsque l'EDR signale un malveillance ?\r\nR : Pas toujours : s'il a été bloqué/mis en quarantaine sans aucune preuve d'exécution, vous pouvez le surveiller ; si une exécution ou des rappels ont eu lieu, isolez et faites remonter le problème.\r\n\r\nQ2 : Comment gérons-nous les alertes de « voyage impossible » pour le personnel distant utilisant des VPN ?\r\nR : Validez la connexion avec l'ID de l'appareil/l'agent utilisateur et les adresses IP de sortie VPN connues ; traitez les connexions réussies avec des actions suspectes ultérieures comme dignes d'une escalade.\r\n\r\nQ3 : Quelle est la plus grosse erreur dans le tri des PME ?\r\nR : Corriger d'abord et enquêter ensuite : contenir et conserver les preuves avant le nettoyage afin de pouvoir confirmer la portée et éviter toute récidive."
  }
}